<?php
require('../../bootstrap.inc.php');

$dirs = <<<EOF
头条女神_2018圣诞节快乐--写真集-73P-
头条女神_Baby《少女与猫》-写真集-17P-
头条女神_baby《性感肚兜-恋恋红尘》-写真集-20P-
头条女神_Baby《民国偶像美少女》-写真集-12P-
头条女神_COCO《丝袜特刊》-写真集-66P-
头条女神_COCO《油画小学妹》-写真集-41P-
头条女神_Frida《轻舞飞扬-黑纱睡衣》-写真集-29P-
头条女神_Janny《健身房-女神运动》-写真集-16P-
头条女神_Janny《小公主白裙》-写真集-9P-
头条女神_Janny《百万宝贝》-写真集-14P-
头条女神_janny《花房姑娘》-写真集-20P-
头条女神_JennyR《008期丝蜜众筹回报之和风花与蛇》-写真集-9P-
头条女神_JennyR《008期丝蜜众筹回报之情绪人像》-写真集-18P-
头条女神_JennyR《008期丝蜜众筹回报旗袍片上辑》-写真集-12P-
头条女神_JennyR《jenny的健身日常》-写真集-10P-
头条女神_JennyR《珍妮的和风诱惑》-写真集-80P-
头条女神_JennyR《辣姐DJ》-写真集-15P-
头条女神_kitty《泛太平洋BadBitch》-写真集-25P-
头条女神_kitty《泛太平洋泳衣黑丝高叉》-写真集-26P-
头条女神_kitty《雪肌香肩-圣诞特辑》-写真集-26P-
头条女神_legbaby小蕊《欲情草帽少女》-写真集-19P-
头条女神_Lucy《羞涩蜜腿诱惑》-写真集-17P-
头条女神_Maggie《吉普赛女郎-轻舞飞扬》-写真集-25P-
头条女神_Olivia童安琪《宅男狩猎-内衣LOGO》-写真集-24P-
头条女神_Sukki可儿《性感开发-热情白衬衣》-写真集-25P-
头条女神_Sukki可儿《最佳姿态-蓝纱裙》-写真集-28P-
头条女神_Sukki可儿《黑色高叉巨乳娘》-VIP专享-写真集-27P-
头条女神_Yilia《粉红少女心》-写真集-23P-
头条女神_YOYO《肉感奴隶-白衬衫黑丝选片》-VIP专享-写真集-26P-
头条女神_一丹-亦丹《成人和服》-写真集-20P-
头条女神_丁筱南《白の诱惑》-写真集-23P-
头条女神_丁筱南《绝色空姐》-写真集-14P-
头条女神_丁筱南《魅惑丝袜控》-写真集-16P-
头条女神_七姑娘-安雨琪《画中少女》-写真集-20P-
头条女神_丹丹-amp-amp-amp-亚鑫《美人姐妹萌萌哒》-写真集-33P-
头条女神_丹丹-amp-amp-amp-小曼《女女双飞》办公室OL系列-写真集-29P-
头条女神_丹丹-amp-amp-amp-小曼《女女双飞》浴室系列-写真集-38P-
头条女神_丹丹《君子好球》-写真集-25P-
头条女神_丹丹《夜店朋克女郎》-写真集-29P-
头条女神_丹丹-大丹丹Jessi《加州旅馆》-写真集-28P-
头条女神_丹丹-大丹丹Jessi《死飞丽影》-写真集-20P-
头条女神_丹丹《感性淑女》-写真集-23P-
头条女神_丹丹《我是校花》-写真集-22P-
头条女神_丹丹《爱在深秋》-写真集-26P-
头条女神_丹丹《究极body》-写真集-28P-
头条女神_丹丹《自觉诱惑》-写真集-22P-
头条女神_丹丹-贾丹《卿本佳人-中国红高叉比基尼》-VIP特辑-写真集-42P-
头条女神_丹丹-贾丹《夏娃之禁果》-写真集-23P-
头条女神_乔安《厨娘的日常2》-写真集-16P-
头条女神_乔安《黑纱》-写真集-31P-
头条女神_乔米《私房美少女》-写真集-29P-
头条女神_于逸之《魅力玉女》-写真集-20P-
头条女神_亚鑫《浴室春光-黑色情趣选片》-写真集-19P-
头条女神_亚鑫-许灵鑫《心有灵鑫-透视黑旗袍》-写真集-21P-
头条女神_亚鑫-许灵鑫《性感女仆力觉醒》-写真集-26P-
头条女神_亦丹《芭比娃娃-维多利亚的秘密》-写真集-35P-
头条女神_伊一《美腿女王》-写真集-24P-
头条女神_伊一《薄纱睡衣》-写真集-23P-
头条女神_伊莎贝拉《贝拉的幻想》-写真集-22P-
头条女神_伊诺《蜜臀御姐》-写真集-26P-
头条女神_伊诺《蜜臀皇后》-写真集-15P-
头条女神_佑熙《乳牛23号-公牛队服》-写真集-20P-
头条女神_佑熙《催眠淑女-情趣紧身裙》-写真集-23P-
头条女神_佑熙《告白天使》-写真集-25P-
头条女神_佑熙-曲佑熙Abby《粉嫩小女仆》-写真集-18P-
头条女神_佑熙-曲佑熙Abby《连体高叉》-写真集-22P-
头条女神_何娇娇《粉黛娇女情-浴缸尤物》-写真集-26P-
头条女神_何娇娇-药药《夜的私欲-平安夜双飞》-VIP专享-写真集-40P-
头条女神_何娇娇-药药《看护妇双飞》-VIP专享-写真集-31P-
头条女神_何娇娇-药药《粉黛娇娃-浴缸小护士》-VIP专享-写真集-22P-
头条女神_何娇娇、药药《肉丝双飞》-VIP专享-写真集-22P-
头条女神_《俄罗斯大妞合辑-春风一度》-写真集-25P-
头条女神_信悦儿Paris《豹纹限定》-VIP专享-写真集-27P-
头条女神_信悦儿《大蜜范儿》-写真集-22P-
头条女神_信悦儿《美的香菇-学生制服控》-写真集-21P-
头条女神_冯雪娇-amp-amp-amp-梦心玥-amp-amp-amp-娜依灵儿《疯狂圣诞节》-写真集-20P-
头条女神_冯雪娇《和服之韵》-写真集-62P-
头条女神_冯雪娇《女神厨娘》-写真集-23P-
头条女神_冯雪娇《尤物人生》-写真集-17P-
头条女神_冯雪娇《悦足佳人》-写真集-35P-
头条女神_冯雪娇《超级碗杯4》-写真集-26P-
头条女神_冯雪娇《黑裙丽人》-写真集-20P-
头条女神_冰冰《纯真年代-白色小背心》-写真集-22P-
头条女神_冰冰《花漾玩物-性感女仆》-写真集-20P-
头条女神_冰冰-赵冰冰《黑旗袍-勾丝美足》-写真集-15P-
头条女神_凯竹BuiBui《乳神拳王》-写真集-20P-
头条女神_凯竹《克城乳宝》-写真集-18P-
头条女神_凯竹《兔子娃娃》-VIP专享-写真集-13P-
头条女神_凯竹《风情黑丝》-VIP专享-写真集-27P-
头条女神_刘芸熙《夏の露出》-写真集-20P-
头条女神_刘菲菲《大白兔兔》-写真集-23P-
头条女神_刘雨露《紫色浴袍的百分百加成》-写真集-43P-
头条女神_刘雨露《蜜桃成熟时-内衣小妖精》-写真集-39P-
头条女神_卓然《黑纱白纱》-写真集-31P-
头条女神_《厨房娇娘合集》-写真集-65P-
头条女神_可儿-SukkiQ《放课后美少女》-写真集-21P-
头条女神_可儿《女子校生-学生制服》-写真集-25P-
头条女神_可儿《魅惑小乳牛-巨乳妄想》-VIP专享-写真集-21P-
头条女神_吴晗娜《夕阳下的舞姿》-写真集-21P-
头条女神_周予然《恒大女神》-写真集-25P-
头条女神_周凌《粉色毛衣意识早熟》-写真集-20P-
头条女神_周凌《雪冷美人》-写真集-17P-
头条女神_周凌《雪肌薄衣》-写真集-24P-
头条女神_周夕爱-周营莹《叫我女王》-VIP特辑-写真集-20P-
头条女神_周夕爱《小红魔宝宝-致敬曼联》-写真集-19P-
头条女神_周夕爱《您DE黑丝小秘书》-写真集-31P-
头条女神_周思超JUNO《我是海军》-写真集-45P-
头条女神_周思超《极度暴露激情诱惑》-VIP专享-写真集-38P-
头条女神_周思超《极致性感天使女仆》-写真集-25P-
头条女神_周治宇-周治钰《梦中爆乳美娘》-写真集-17P-
头条女神_周熙妍-amp-amp-amp-白甜《圣诞快乐时光》-写真集-25P-
头条女神_周熙妍《学生服幻想萝莉》-写真集-19P-
头条女神_周熙妍《小可爱女孩》-写真集-18P-
头条女神_周熙妍《期中考试》-写真集-22P-
头条女神_周熙妍《梦游仙境》-写真集-78P-
头条女神_周熙妍《网红毛衣》-写真集-30P-
头条女神_周熙妍《酸酸甜甜就是我》-写真集-57P-
头条女神_周营营-周夕爱《再见小姨多鹤》-写真集-43P-
头条女神_周营营-周夕爱《气质女神-包臀紧身黑丝控》-写真集-21P-
头条女神_哈拿Hana《混血小美女》-写真集-31P-
头条女神_哈拿《魔女宅急变-野外露出》-写真集-60P-
头条女神_唐嫣儿《绳艺物语》-写真集-9P-
头条女神_唐嫣《蜜汁熟女2》-VIP专辑-写真集-33P-
头条女神_唐雅雯《总裁助理》-写真集-28P-
头条女神_囡囡《红泳衣少女》-写真集-22P-
头条女神_团团《高卢热浪》-写真集-9P-
头条女神_园园-amp-amp-amp-爱丽莎《新年吉祥》-写真集-22P-
头条女神_夏夏姐妹花《双人派对》-写真集-41P-
头条女神_夏夏《彼岸花开》-写真集-24P-
头条女神_夏笑笑Summer-慕晴儿《女佣大征服》-VIP特辑-写真集-33P-
头条女神_夏笑笑《兼职学妹》-写真集-19P-
头条女神_夏笑笑《女神降临》-写真集-36P-
头条女神_夏笑笑《蜜桃熟时-甜心小女生》-VIP专辑-写真集-24P-
头条女神_《外模精选合集》-写真集-79P-
头条女神_大悦悦《老Roger的官邸-剃须刀系列》-VIP专享-写真集-24P-
头条女神_大悦悦-黎黎Lily《不纯蕾丝》-VIP专享-写真集-24P-
头条女神_大晗《你的篮球宝贝女友》-写真集-15P-
头条女神_大晗《双球美模》-写真集-10P-
头条女神_大晗《大爱无疆》-写真集-31P-
头条女神_大晗《情深桑巴世界杯》-写真集-25P-
头条女神_大晗《懂球妹》-写真集-26P-
头条女神_大晗《瑰丽学生黑丝》-写真集-26P-
头条女神_大晗-白一晗《女仆咖啡厅剧情》-写真集-47P-
头条女神_大晗《美味甜心》-写真集-19P-
头条女神_大晗《花裙妹妹-我是小奶牛》-写真集-30P-
头条女神_大树《拳击性感秀》-写真集-18P-
头条女神_天使《天使之恋》-写真集-16P-
头条女神_天使《山肆扬》-写真集-17P-
头条女神_奕丹-亦丹《红肚兜》-写真集-43P-
头条女神_奢华女王丹丹《将爱》-VIP专享-写真集-32P-
头条女神_奥利-amp-amp-amp-悦悦《连体姿态》-写真集-16P-
头条女神_如意《妙龄闺蜜》-写真集-25P-
头条女神_如意《泛太平洋网袜》-写真集-25P-
头条女神_如意《运动甜心》-写真集-20P-
头条女神_《妩媚娇娃-外模合集》-写真集-21P-
头条女神_妮妮《万种风情-篮球宝贝》-写真集-19P-
头条女神_妮小妖《绝色美人图》-写真集-20P-
头条女神_娇娇小朋友《我的大长腿！》--写真集-29P-
头条女神_娜依灵儿-易阳-白一晗-冯雪娇《合体超级碗》-写真集-16P-
头条女神_娜依灵儿《蜜臀物语-梨涡浅笑》-VIP专享-写真集-40P-
头条女神_娜依灵儿《超级碗杯1》-写真集-29P-
头条女神_娜依灵儿《风情异域》-写真集-13P-
头条女神_娜露selena《不要吃兔兔！》--写真集-29P-
头条女神_娜露selena《情绪人生》-写真集-19P-
头条女神_婉君《脉脉思情-妻子の诱惑》-写真集-27P-
头条女神_婉君《迷情小女生》-写真集-25P-
头条女神_婧婧-林蕾《娇羞清纯学妹》-写真集-51P-
头条女神_婧婧-林蕾《美少女战士》-写真集-41P-
头条女神_婧婧《蜜桃成熟-最美湿身少女》-写真集-16P-
头条女神_媛媛-李媛媛《夜太美丽》-写真集-32P-
头条女神_子兮《愤怒的少女樱》-写真集-38P-
头条女神_子兮《芳草绿纱-仲夏绿萍》-写真集-27P-
头条女神_子涵《待嫁闺中》-写真集-14P-
头条女神_孙远-模特远远《童颜遇止》-写真集-19P-
头条女神_孙远《甜蜜高尔夫-纯真韩风小美女》-写真集-10P-
头条女神_孙远《生命本源的悸动》-写真集-27P-
头条女神_宁宁《动感单车女郎》-写真集-20P-
头条女神_宁宁《日光少女》-写真集-28P-
头条女神_安甜《极致女仆》-写真集-45P-
头条女神_安苏芮《古典花语女神》-VIP专享-写真集-26P-
头条女神_安苏芮《红肚兜-满足调教》-写真集-17P-
头条女神_完颜芝芝《乳此动人》-写真集-36P-
头条女神_完颜芝芝-张芝芝《逆天巨乳》-写真集-27P-
头条女神_宸希《七夕幻梦》-写真集-23P-
头条女神_宸希《清纯小妖刀-篮球LOGO》-写真集-22P-
头条女神_宸希《粽情端午》-VIP专辑-写真集-16P-
头条女神_宸熙《日系小女生-生如夏花》-写真集-19P-
头条女神_小乔-乔静-《美丽的小乔》-写真集-19P-
头条女神_小五一《居家妙臀姐姐》--写真集-28P-
头条女神_小唐嫣《蜜汁熟女1》-写真集-25P-
头条女神_小如镜《水晶舞鞋》-写真集-25P-
头条女神_小如镜《白袜子人间物语》-写真集-26P-
头条女神_小林《独占视线》-写真集-25P-
头条女神_小林《绿蓝菱》-写真集-28P-
头条女神_小梦-amp-amp-amp-维维《闺中密友》-写真集-23P-
头条女神_小梦-凌兮涵《芭蕾遗梦2》-写真集-20P-
头条女神_小梦梦《萌魅黑裙》-写真集-37P-
头条女神_小梦《芭蕾遗梦2》-VIP特辑-写真集-18P-
头条女神_小爱《敏感新妻》-写真集-26P-
头条女神_小米粒儿-顾籼《仙女下凡》-写真集-25P-
头条女神_小米粒儿-顾籼《超美童颜情趣比基尼》-VIP专享-写真集-19P-
头条女神_小米粒-顾籼《超美护士-打针也不怕》-写真集-24P-
头条女神_小绮-胡宴绮Nancy《美腿皇后》-写真集-40P-
头条女神_小美《家有美神-壁橱系列》-写真集-25P-
头条女神_小美-林美儿《绿纱媚娘》-写真集-20P-
头条女神_小美《浴室透明欲娘》-写真集-20P-
头条女神_小美纯子《人妻紧缚》-写真集-22P-
头条女神_小美纯子-张纯《黑发天使-牛仔短裤》-写真集-23P-
头条女神_小美-黎美Cici《邻家美神-网袜系列》-写真集-17P-
头条女神_小蕊-唐蕊《少女花嫁-日系居家》-VIP专辑-写真集-20P-
头条女神_小蕊-唐蕊《粉嫩取精者-红衣护士》-VIP专享-写真集-33P-
头条女神_小超人juno-周思超《浴室迷情-春光乍泄》-写真集-30P-
头条女神_小逸《下一站天后》-写真集-25P-
头条女神_小雅-张晓雅《悦动蓝精灵》-写真集-25P-
头条女神_小雅《美娇娘入怀-一个人的红睡衣》-写真集-44P-
头条女神_小雨《野外极致露出》-写真集-34P-
头条女神_小青青-沈晓青《腿玩十年-花季芭比颜值拳击》-写真集-22P-
头条女神_小鱼儿-鱼宝宝《天然纯甄》-写真集-22P-
头条女神_小鱼-苏凉《我是萌宠-可爱小猫猫》-写真集-25P-
头条女神_尹菲《薄纱娇娘》--写真集-22P-
头条女神_崔昭妍-艾米---写真集-28P-
头条女神_崔昭妍《雪屋比基尼》-写真集-23P-
头条女神_崔爱熙《哆啦A梦小叮当》-写真集-22P-
头条女神_崔爱熙《混血萝莉》-写真集-36P-
头条女神_希希《悠长假期-W酒店黑短裤》-写真集-21P-
头条女神_希雅《36D蕾丝女仆》-VIP专享-写真集-28P-
头条女神_希雅BB《美少女发射-青春靓女选片》-写真集-22P-
头条女神_希雅《女の美黑丝丝足大片》-VIP专享-写真集-25P-
头条女神_张咪咪《波多野结咪》-写真集-21P-
头条女神_张咪咪《波霸世纪》-写真集-19P-
头条女神_张子珂《最美AJ女郎》-写真集-34P-
头条女神_张子珂《魅惑搏击》-写真集-26P-
头条女神_张小梦-凌兮涵《露出在山谷的美臀》-写真集-34P-
头条女神_张晓雅-小雅《清纯白衬衫》-写真集-32P-
头条女神_张梓柔《美艳厨娘》-写真集-33P-
头条女神_张梓柔《魅与惑》-写真集-20P-
头条女神_张梓然《画中维纳斯》-VIP专享-写真集-26P-
头条女神_张梓然《白魅青花舞娘》-VIP专享-写真集-27P-
头条女神_张梓然《红色警报-红衣魅影》-VIP专享-写真集-29P-
头条女神_张梓然《蓝色妖姬》--写真集-9P-
头条女神_张梓然《难觅好臀-古典睡衣》-VIP专享-写真集-22P-
头条女神_张梓然《黑蜜诱惑》-VIP专享-写真集-23P-
头条女神_张梦艺《午夜梦呓-黑丝美足》-写真集-24P-
头条女神_张梦艺《夜色小妖精》-写真集-25P-
头条女神_张梦艺《蓝丝恋人》-写真集-25P-
头条女神_张爽《定义为16岁的少女难道只有萌吗》-写真集-33P-
头条女神_张爽《黑丝萌妹小秘书》-写真集-26P-
头条女神_张蓝欣《滑嫩肌理-大长腿玩年》-写真集-39P-
头条女神_张译丹《丰乳肥臀》-写真集-46P-
头条女神_张雨萌-纯小希《国民偶像》-写真集-21P-
头条女神_恬美《浴姐之恋》-写真集-35P-
头条女神_恬美《痴情巨臀-白色内衣》-写真集-17P-
头条女神_恬美《美臀开发-白衬衫之清晨》-写真集-28P-
头条女神_恬美《黑丝妄想-恬美美腿美臀》-VIP专享-写真集-25P-
头条女神_悠悠《银色泳装悠长假日》-写真集-22P-
头条女神_悦悦-amp-amp-amp-奥利《保姆零食快乐时光奥利奥》-写真集-31P-
头条女神_文雪Cher《绝对头牌女神》-写真集-41P-
头条女神_文雪《人间尤物-浴室湿身终极诱惑》-写真集-29P-
头条女神_文雪《圣诞祝福-性感大片》-VIP专享-写真集-36P-
头条女神_文雪《复出纪念-盛世尤物》-写真集-23P-
头条女神_文雪《最美科蜜》-写真集-14P-
头条女神_文雪《美足物语特刊》-写真集-46P-
头条女神_文雪《阿狸九尾雪宝cos》-写真集-25P-
头条女神_斯童《浴室极致露出》-写真集-13P-
头条女神_斯羽-戴丝羽《爵士美伶套装》-写真集-21P-
头条女神_易阳《36D女神天团》-写真集-36P-
头条女神_易阳《双手控球》--写真集-9P-
头条女神_易阳《天生女神》-写真集-21P-
头条女神_易阳《女神预测世界杯》-写真集-11P-
头条女神_易阳《我的花漾年华》--写真集-9P-
头条女神_易阳-易秀慧《回家的诱惑-爆乳仙女》-写真集-29P-
头条女神_易阳《花野仙踪-花踪仙子》-写真集-10P-
头条女神_易阳《超级碗杯③》-写真集-26P-
头条女神_易阳、金卓然《逝水流年》-写真集-24P-
头条女神_晓梦-张小梦《芭蕾遗梦-校花制服诱惑》-写真集-41P-
头条女神_景淳《美腿小公主》--写真集-16P-
头条女神_晴子《巨乳少妇尤物》-写真集-20P-
头条女神_曼苏拉娜《井上彩子cos篮球宝贝》-写真集-25P-
头条女神_曼苏拉娜《你的曼苏拉娜老师》--写真集-21P-
头条女神_曼苏拉娜《小时候的梦想是做一名空姐》-写真集-11P-
头条女神_曼苏拉娜《巨乳依偎-性感小女生》-写真集-24P-
头条女神_曼苏拉娜《湿身露出-性感居家小背心》-VIP专享-写真集-28P-
头条女神_曼苏拉娜《理性崩坏-女仆写真》-VIP专享-写真集-28P-
头条女神_曼苏拉娜《金丝曼苏-金色比基尼》-写真集-22P-
头条女神_朱莉娅-倪叶藤《早开的晚霞-爱上托马斯》-写真集-25P-
头条女神_朵朵《凤凰涅槃的叛逆美少女》-写真集-39P-
头条女神_朵朵《清纯小妹》-写真集-33P-
头条女神_李丽莎《一帘幽梦》-写真集-23P-
头条女神_李丽莎《最美球媛》-写真集-14P-
头条女神_李思彤《清纯学妹》-写真集-32P-
头条女神_李梓熙《SSS级熟女》-写真集-25P-
头条女神_李梓熙《乳地最强》-VIP特辑-写真集-25P-
头条女神_李梓熙《全身解禁-洛天依COS》-VIP专享-写真集-29P-
头条女神_李梓熙《欲望号街车-吊带睡衣》-写真集-20P-
头条女神_李梓熙《汤泉美人》-写真集-8P-
头条女神_李梓熙《牛奶浴女》-VIP专享-写真集-6P-
头条女神_李梓熙《白桂院凛凛蝶-九尾狐狸COS》-VIP专享-写真集-28P-
头条女神_李梓熙《花花仙子》-写真集-34P-
头条女神_李梓熙《蜜汁痴女-红肚兜》-VIP专享-写真集-39P-
头条女神_李梓熙《金屋藏娇》-写真集-29P-
头条女神_李梓熙《领家小奶牛》-VIP特辑-写真集-19P-
头条女神_李由美《红色警报》-VIP专享-写真集-16P-
头条女神_李菲儿《旗袍透视》-写真集-24P-
头条女神_李菲儿《爆乳私教》-写真集-20P-
头条女神_李菲儿《绝世好胸-致敬库里》-写真集-15P-
头条女神_李菲儿《那些花儿》-写真集-26P-
头条女神_李辰明月《长腿嫩模小萝莉》-写真集-38P-
头条女神_李雪《雪儿乖乖》-写真集-30P-
头条女神_杏儿kitty《乳脂肆意-性感黑色内衣》-写真集-16P-
头条女神_杏儿kitty《圣诞女郎》-写真集-7P-
头条女神_杜卡迪《女技师》--写真集-16P-
头条女神_杜花花《垂涎欲出》-写真集-39P-
头条女神_杜菲菲《欲望号街车》-写真集-30P-
头条女神_杜菲菲《欲望都市》-写真集-25P-
头条女神_杨曼妮《爆乳小女仆》-VIP专享-写真集-30P-
头条女神_杨漫妮《丰乳肥臀小女生捆缚篇》-VIP专享-写真集-29P-
头条女神_杨漫妮《乳摇放映-阿拉蕾》-VIP专享-写真集-31P-
头条女神_杨漫妮《少女回春-宫廷小肚兜》-VIP专辑-写真集-17P-
头条女神_杨漫妮《巨乳芭比-兔女郎》-VIP专享-写真集-28P-
头条女神_杨漫妮《绿色小妖》-写真集-25P-
头条女神_林亭音-金圣雪《性感浴袍》-写真集-14P-
头条女神_林依依《丽质天生-黑丝女王》-写真集-15P-
头条女神_林宛倪《五十度灰》-写真集-11P-
头条女神_林宛倪《莺歌尤物》-写真集-24P-
头条女神_林茜《电音诱惑》-写真集-18P-
头条女神_林蕾《乳香四溢-黑丝连体》-VIP专享-写真集-26P-
头条女神_林蕾《敏感仙子-连体黑丝》-写真集-26P-
头条女神_林蕾、杏儿kitty《公主女仆-云燕双飞》-VIP专享-写真集-34P-
头条女神_林蕾《林蕾の圣诞节》-写真集-25P-
头条女神_林韵竹《金属丝滑吊带裙》--写真集-17P-
头条女神_柠檬《午间污睡》-写真集-25P-
头条女神_查莉娅《萌娘诺娃》-写真集-15P-
头条女神_柳杭《美艳诱惑》-写真集-39P-
头条女神_格格《猫女郎》-写真集-26P-
头条女神_格格《蓝丝之恋》-写真集-20P-
头条女神_桃美洋子《世界巨乳-高叉选片》-VIP专享-写真集-30P-
头条女神_桃美洋子《性感宫廷巨乳》-VIP专享-写真集-20P-
头条女神_桃美洋子《抹胸兔兔》-写真集-13P-
头条女神_梁芮溪《完美丝界》-VIP特辑-写真集-28P-
头条女神_梁芮溪《美到无敌》-写真集-26P-
头条女神_梁芮溪《芭拉小魔仙2》-写真集-16P-
头条女神_梁芮溪《萝莉小魔仙》-写真集-24P-
头条女神_梦心玥《世界杯主题-惹火女郎》-写真集-30P-
头条女神_梦心玥《女神运动-健身房性感选片》-写真集-34P-
头条女神_梦心玥《宫锁心玥-无内连体丝袜》-VIP特辑-写真集-45P-
头条女神_梦心玥《心月女神-篮球宝贝》-写真集-23P-
头条女神_梦心玥、文雪、丹丹《新春拜年特刊》-VIP专享-写真集-61P-
头条女神_梦心玥《欲望丝袜-黑丝精选》-写真集-22P-
头条女神_梦心玥《水蜜桃贵妇》-写真集-31P-
头条女神_梦心玥《理想情人》-VIP专享-写真集-31P-
头条女神_梦心玥《秋水伊人-情趣绿肚兜》-写真集-27P-
头条女神_梦涵《烟雨京郊-云雨江南》-写真集-41P-
头条女神_《梦游仙境》-写真集-10P-
头条女神_梦灵娇-冯雪娇-amp-amp-amp-梦心玥-amp-amp-amp-娜依灵儿-《2017平安夜特辑》-写真集-28P-
头条女神_樊安妮Anne《暗黑性体验-捆绑艺术》-写真集-23P-
头条女神_樊安妮《体验少女》-写真集-32P-
头条女神_樊安妮《垂钓美人》-写真集-44P-
头条女神_樊安妮《女宠安妮》-写真集-28P-
头条女神_樊安妮《安妮借宿》-写真集-21P-
头条女神_樊安妮《悍马拘禁》-写真集-24P-
头条女神_樊安妮《情迷安妮》-写真集-20P-
头条女神_樊安妮《白高叉泳衣-完全紧缚》-写真集-17P-
头条女神_樊安妮《真空白丝袜》-写真集-9P-
头条女神_樊安妮《黑皮衣极绳拷问》-写真集-26P-
头条女神_模特小泽《火辣孕妈》-写真集-35P-
头条女神_模特小鱿鱼《爱奴物语》-写真集-28P-
头条女神_模特甜甜《蜜腿画容》-写真集-18P-
头条女神_欣欣《天依娃娃》-写真集-22P-
头条女神_欣欣姐妹《接吻游戏-姐妹花特刊》-VIP专享-写真集-24P-
头条女神_沈晓爱《唱歌的洛玉塔-青春牛仔小萝莉》-写真集-20P-
头条女神_沈晓爱《无限风光在乳峰-雪白内衣》-写真集-20P-
头条女神_沈晓爱《萌猫女仆》-写真集-20P-
头条女神_沈晓青《肉体与颜值》-VIP特辑-写真集-8P-
头条女神_沈晓青《蛇蝎美人2》-VIP专享-写真集-8P-
头条女神_洋洋《禁欲旗袍》-写真集-23P-
头条女神_洛可可《篮球宝贝AJ女郎》-写真集-22P-
头条女神_洛可可《金屋藏娇-性感厨娘》-写真集-21P-
头条女神_洛可可《食色饕餮-肉体性感大餐》-VIP专享-写真集-26P-
头条女神_涟漪SARA《女下属の诱惑》-写真集-25P-
头条女神_涟漪sara《楼下欲姐》-写真集-22P-
头条女神_涟漪sara《膝枕抚慰》-写真集-20P-
头条女神_涟漪《星空美人》-写真集-41P-
头条女神_温婉《倾国倾城》-写真集-20P-
头条女神_温心怡《三八女神节特刊-王者甄姬》--写真集-9P-
头条女神_温心怡《变态巨乳-窗边暖洋》-VIP专享-写真集-19P-
头条女神_温心怡《爱欲少女》-写真集-25P-
头条女神_温心怡《玉藻前・秘书狐COSPLAY》-写真集-33P-
头条女神_温心怡《看护师体验》-VIP特辑-写真集-24P-
头条女神_温心怡《美人搜查》-写真集-22P-
头条女神_温心怡《魅蓝Lady》-写真集-20P-
头条女神_温蒂-Chioa赵伟峰《沐色暖阳小美女》-写真集-32P-
头条女神_温蒂《惹火球妹-嘻哈篮球妹》-写真集-30P-
头条女神_溪童《森林系女仆》-写真集-21P-
头条女神_溪童《蓝色情趣》-写真集-29P-
头条女神_滢儿《可人俏秘书》-写真集-15P-
头条女神_火儿《御姐诱惑》-写真集-7P-
头条女神_火儿《迷情御姐女郎》-写真集-26P-
头条女神_灵儿《拜仁球迷-足球宝贝系列》-写真集-13P-
头条女神_灵儿《闺房白衬衫》-写真集-18P-
头条女神_炮炮《懂球妹》-写真集-21P-
头条女神_熊熊-迪依《无垢美样-清纯小姑娘》-写真集-20P-
头条女神_爱丽莎-amp-amp-amp-九儿《密室SPA》-写真集-49P-
头条女神_爱丽莎Lisa《国足我爱你》-写真集-39P-
头条女神_爱丽莎lisa《用球挺国安》-写真集-29P-
头条女神_爱丽莎《丽思卡尔顿黑晚礼服》-写真集-21P-
头条女神_爱丽莎《元宵饺子》-写真集-21P-
头条女神_爱丽莎《夜上海-旗袍LOGO》-写真集-25P-
头条女神_爱丽莎《女神探店隆太源篇》技师选修-写真集-49P-
头条女神_爱丽莎《女神探店隆太源篇》爱丽莎精修-写真集-25P-
头条女神_爱丽莎《小洋装-甜美媳妇》-写真集-15P-
头条女神_爱丽莎《性感圣诞尤物》-VIP专享-写真集-25P-
头条女神_爱丽莎《我不是潘金莲》-写真集-24P-
头条女神_爱丽莎《指尖の摩擦》-写真集-23P-
头条女神_爱丽莎《美耻美丝娘》-VIP专享-写真集-27P-
头条女神_猫咪6M-樊安妮《女神探店》-写真集-71P-
头条女神_玄子-amp-amp-amp-莫晓希《锦鲤陪你过大年！》--写真集-31P-
头条女神_玄子《你的女老师已上线！哈哈！》-写真集-12P-
头条女神_玄子《哈登是MVP》--写真集-8P-
头条女神_玄子《完美马甲线！》-写真集-10P-
头条女神_玄子《时光留夏》-写真集-24P-
头条女神_玄子《貂蝉-异域舞娘COS》-写真集-30P-
头条女神_玄子《阳光灿烂的玄宝贝》--写真集-10P-
头条女神_王一涵《完美满足你所有恋爱梦想的女孩》-写真集-43P-
头条女神_王一涵《巨臀激情迎奥运》-写真集-18P-
头条女神_王凌宇kino《肤白不粘人-魅力酒店》-写真集-25P-
头条女神_王凌宇《玉腿横足-酷黑比基尼》-写真集-25P-
头条女神_王悦《居家美少妇》-写真集-21P-
头条女神_王悦《绿绫女仆》-写真集-17P-
头条女神_王悦《绿绫小妖-绿妖小少女》-写真集-20P-
头条女神_王枰翔《香汗满屋》-写真集-20P-
头条女神_王竹《call-me-baby》-写真集-18P-
头条女神_王竹-小禾《紧身皮裤》-写真集-27P-
头条女神_王竹《滑嫩玉肌美腿皇后》-写真集-29P-
头条女神_王紫琳《人间胸器-胸怀大志》-写真集-20P-
头条女神_王紫琳《办公室OL》-写真集-33P-
头条女神_王紫琳《我是稻草人-草帽美少女》-写真集-22P-
头条女神_珞可可《极致湿身-白色比基尼》-写真集-28P-
头条女神_琪琪《丰满爆乳》-写真集-5P-
头条女神_琪琪《异域萝莉》-写真集-43P-
头条女神_琪琪《惑魅人生》-写真集-28P-
头条女神_琪琪《潘多拉の诱惑》-写真集-23P-
头条女神_琳妲《花漾少女》-写真集-22P-
头条女神_琳琳《专属长筒球妹》-写真集-22P-
头条女神_琳琳《完璧玉璞-完美女仆-》-VIP专辑-写真集-24P-
头条女神_琳琳《授乳解衣》-写真集-21P-
头条女神_琳琳-李琳梓《俏丽佳人-美足少女》-写真集-22P-
头条女神_琳琳-琳妲-《玲珑妙足》-写真集-13P-
头条女神_琳琳-琳妲--琳儿佳人-写真集-23P-
头条女神_琳琳《瑜舍悦色》-写真集-24P-
头条女神_琳琳《甜心运动》-写真集-18P-
头条女神_琳琳《秀腿可餐-纤纤玉足》-写真集-37P-
头条女神_琳琳《裹体丽人》-写真集-9P-
头条女神_瑞宝儿《浴室肉体诱惑》-VIP特辑-写真集-28P-
头条女神_瑞宝儿《私房猫女郎》-写真集-28P-
头条女神_瑞宝《我的小师妹》-写真集-24P-
头条女神_璐璐《丝丝入口》-写真集-24P-
头条女神_璐璐《梦中爱人》-写真集-14P-
头条女神_瓦娅《凤九湿身-冷艳衬衣》-VIP专享-写真集-42P-
头条女神_瓦娅-阿依努尔瓦娅《公主恋人》-写真集-21P-
头条女神_瓦娅-阿依努尔瓦娅《情欲女爵-爵士冷妹》-写真集-27P-
头条女神_甄甄《居家女王-性感灰背心》-写真集-13P-
头条女神_甄甄《甜美女生学生服》-写真集-33P-
头条女神_甜甜《黑丝甜腻腻》-写真集-52P-
头条女神_田妞《凝脂玉乳》-写真集-42P-
头条女神_田妞《巫山乳神再现》-写真集-38P-
头条女神_申美嫣《peggy美少女战士》-写真集-20P-
头条女神_申美嫣《夜勤派对-peggy女护士》-写真集-25P-
头条女神_申美嫣《奢华少妇》-写真集-31P-
头条女神_申美嫣《极品搜查官》-写真集-36P-
头条女神_申美嫣《极品美人》-写真集-18P-
头条女神_申美嫣《梦回唐朝-沉鱼落雁》-写真集-19P-
头条女神_申美嫣《风情万种》-写真集-28P-
头条女神_白一晗《超级碗女郎2》-写真集-24P-
头条女神_白甜《我是萌萌哒小厨娘》-写真集-34P-
头条女神_白甜《白甜不傻-白白甜甜就是我》-写真集-19P-
头条女神_盼盼已鸠-杨玉奴《凤凰黑丝乳娘》-VIP专享-写真集-26P-
头条女神_盼盼-杨玉奴《夜色小恶魔》-VIP专享-写真集-32P-
头条女神_神琦泽步《芭比娃娃》-写真集-20P-
头条女神_秦若兮《芊芊玉足-黄昏的邂诟》-写真集-58P-
头条女神_穆菲菲《年轻妻子》-写真集-16P-
头条女神_穆菲菲《情趣黑丝大作战》-写真集-23P-
头条女神_穆菲菲《禁忌姐姐-夜店风》-写真集-15P-
头条女神_空白格《垂涎欲滴》-写真集-25P-
头条女神_空白格《奉仕专用-会员私服》-VIP专享-写真集-19P-
头条女神_童安琪《丰乳肥臀-3D豪情》-VIP专享-写真集-23P-
头条女神_童安琪《乳此霸道》-写真集-19P-
头条女神_童安琪《巨乳搜查官》-VIP专享-写真集-26P-
头条女神_童安琪《浴室春光》-写真集-21P-
头条女神_童安琪《瑰丽佳人》-写真集-17P-
头条女神_童安琪《黑丝女宴-黑丝女仆》-VIP专享-写真集-33P-
头条女神_笑笑《七夕の情缘①》-写真集-36P-
头条女神_笑笑《旋转木马》-写真集-24P-
头条女神_《第五人格》-写真集-46P-
头条女神_筱妮-妮小妖《草莓牛奶-青春学生妹》-写真集-20P-
头条女神_筱慧-amp-amp-amp-药药《蕾丝爱人》-写真集-33P-
头条女神_筱慧《丽质天生-舞蹈少女》-写真集-40P-
头条女神_筱慧《家有美奴①》-写真集-30P-
头条女神_筱慧《恰似你的温柔》-写真集-24P-
头条女神_筱慧-段筱慧《万种风光-包臀短裙》-写真集-18P-
头条女神_筱慧《灵魂舞者》-写真集-19P-
头条女神_筱慧-筱慧Icon《天使の颜-性感红色连身短裙》-写真集-24P-
头条女神_筱慧《绳の凌虐》-写真集-24P-
头条女神_筱慧《肤白美肌-性感肚兜》-写真集-23P-
头条女神_筱慧《蕙质兰心》-写真集-13P-
头条女神_筱溪《女仆兔兔》-写真集-30P-
头条女神_筱溪《脉脉含情》-写真集-38P-
头条女神_筱溪《致敬孤胆英雄麦迪》-写真集-24P-
头条女神_米娅《修车美女》-写真集-20P-
头条女神_米娅《妖冶美艳OL》-写真集-67P-
头条女神_米娅《美足秘书》-写真集-24P-
头条女神_米璐《六一快乐》-写真集-22P-
头条女神_米璐《蜜桃少女》-写真集-23P-
头条女神_米璐《蜜臀玉乳》-写真集-17P-
头条女神_米粒儿-顾籼《御魂莹草COS》-写真集-25P-
头条女神_米雪-amp-amp-amp-金子《丝蜜女王-夜店姐妹花》-写真集-16P-
头条女神_米雪-amp-amp-amp-金子《同桌的你》-写真集-34P-
头条女神_米雪《女神预测世界杯》-写真集-10P-
头条女神_米雪《粉红护理小护士》-写真集-29P-
头条女神_米雪《蜜桃熟时》-写真集-34P-
头条女神_糖糖《不爱吃糖的糖糖》-写真集-14P-
头条女神_糖糖《黑与白的纯净女孩》-写真集-9P-
头条女神_索菲《各位乘客，请坐稳扶好！》-写真集-9P-
头条女神_索菲《轻熟风韵》-写真集-11P-
头条女神_纯小希-萌萌《黑丝LOGO-秀腿可餐》-写真集-24P-
头条女神_纳斯佳《意大利风情》-写真集-39P-
头条女神_绮儿-胡宴绮《暗黑系巨乳小黑兔》-写真集-8P-
头条女神_缘分《原来是你》-写真集-25P-
头条女神_罗蔓蒂《家有嫩妻》-写真集-19P-
头条女神_美伊《死库水的秘密诱惑》--写真集-28P-
头条女神_美伊《贤惠美少女》--写真集-8P-
头条女神_美惠子《大哥的女人》-写真集-23P-
头条女神_美惠子《我是恬美小姐姐》-写真集-9P-
头条女神_美惠子《霸气纹身-大哥的女人》-写真集-14P-
头条女神_美慧子《韩系宝宝黑丝美腿》-写真集-24P-
头条女神_美汐《丝袜女皇》-写真集-19P-
头条女神_美纳子《OL女神降临》-写真集-17P-
头条女神_美纳子《丽思卡尔顿皮衣》-写真集-31P-
头条女神_美纳子《教师节快乐》-写真集-17P-
头条女神_耿珊珊《丝袜特刊-女王范儿》-写真集-41P-
头条女神_耿珊珊《花房姑娘》-写真集-32P-
头条女神_胡宴绮《美女与大Xiong》-写真集-20P-
头条女神_舒文《校花女神》-写真集-15P-
头条女神_良人《神级美腿》-写真集-43P-
头条女神_良人《良人美景-花漾年华》-写真集-22P-
头条女神_良人《芳华锦绣-花样年华》-写真集-20P-
头条女神_艺潇《浴缸人体》-VIP专享-写真集-21P-
头条女神_艺潇《素人露出》-写真集-16P-
头条女神_艾小青《一百分女王》-写真集-22P-
头条女神_艾小青《女神探店水铂宫篇》-写真集-50P-
头条女神_艾小青《宝宝の假日》-写真集-31P-
头条女神_艾小青《恋人婚嫁-试衣间》-写真集-10P-
头条女神_艾小青《浴缸天然少女》-写真集-23P-
头条女神_艾小青《绳敷快感》-写真集-24P-
头条女神_芃芃《性感韦蜜-篮球宝贝系列》-写真集-21P-
头条女神_芃芃《薄纱私房露出》-写真集-19P-
头条女神_芃芃《黑丝玉足与比基尼》-写真集-25P-
头条女神_芊雪《美腿素人》-写真集-20P-
头条女神_芊雪《芊芊阙歌》-写真集-12P-
头条女神_苏凉-小鱼-《我爱兔兔》-写真集-20P-
头条女神_苏凉-小鱼《绝美萌神库司令》-写真集-20P-
头条女神_苏凉《我是美丽小车模》--写真集-22P-
头条女神_苏可可《私藏玩物》-写真集-26P-
头条女神_苏子淇《倔强的美丽》-写真集-31P-
头条女神_苏子淇《如梦如幻》-写真集-41P-
头条女神_苏沫《家有御姐》-写真集-12P-
头条女神_苏沫《家有美尻御姐》-写真集-13P-
头条女神_苏沫《水天如沐-淑女浴室》-写真集-26P-
头条女神_苏沫《熟女搜索》-写真集-16P-
头条女神_苏沫《玲珑御姐》-写真集-20P-
头条女神_苏沫《美御姐》-写真集-29P-
头条女神_苏菲菲《元气少女-蜜桃熟时》-写真集-22P-
头条女神_草莓-谢忆清June《童颜巨乳》-写真集-34P-
头条女神_药药-amp-amp-amp-筱慧《美奴双娇》-写真集-22P-
头条女神_药药《女王驾到》-写真集-17P-
头条女神_药药《洪荒尤臀》-写真集-24P-
头条女神_药药《粉黛浴缸》-写真集-18P-
头条女神_药药-萌汉药baby《火辣性感小背心》-VIP专辑-写真集-17P-
头条女神_莎伦《我是网球美少女》-写真集-22P-
头条女神_莫小希-amp-amp-amp-林依依《超短裙女生-美丽汇》-写真集-40P-
头条女神_莫小希《蕾丝女王》-写真集-27P-
头条女神_莫晓希《丝蜜008期众筹回报特别篇-下辑》-写真集-6P-
头条女神_莫晓希《冬日暖阳》--写真集-9P-
头条女神_莫晓希《喵一样的小女人》-写真集-10P-
头条女神_莫晓希《女神瑜伽》--写真集-9P-
头条女神_莫晓希《好有爱的清晨！！》--写真集-12P-
头条女神_莫晓希《小兔兔给大家拜早年！》--写真集-9P-
头条女神_莫晓希《小希的和风诱惑》-写真集-20P-
头条女神_莫晓希《我的80回忆-》--写真集-11P-
头条女神_莫晓希《王者荣耀杨玉环COS》-写真集-18P-
头条女神_莫晓希《白色蕾丝爱人》--写真集-24P-
头条女神_菲儿-amp-amp-amp-夏笑笑《接吻姐妹双飞》-VIP专辑-写真集-26P-
头条女神_菲儿《兔子乖乖》-写真集-40P-
头条女神_菲儿《小小恶魔-古风旗袍》-VIP专辑-写真集-29P-
头条女神_菲菲《人妻捆缚》-写真集-24P-
头条女神_萌琪琪Irene《海魂之心》-写真集-28P-
头条女神_萌琪琪《丝丝入袜》-VIP特辑-写真集-39P-
头条女神_萌萌-K8傲娇萌萌《萝莉空乘》-写真集-18P-
头条女神_萌萌-傲娇萌萌《暗黑肉欲料理-黑色厨娘》-写真集-18P-
头条女神_萌萌-张雨萌《美人笑颜》-写真集-19P-
头条女神_萱宸Beata《婀娜蓝袍-性感旗袍》-写真集-20P-
头条女神_萱宸Beata《快乐调教-性感比基尼》-写真集-20P-
头条女神_萱宸《万圣娘娘》-写真集-26P-
头条女神_萱宸《当代女帝》-写真集-14P-
头条女神_萱宸《春色氤氲-刺绣睡衣》-写真集-16P-
头条女神_蔡楠《塞班风情》-写真集-13P-
头条女神_蔡楠《翘臀媚娘-心中の女神》-写真集-16P-
头条女神_蔡楠《肉玉蒲团》-写真集-9P-
头条女神_蔡老师《私人空乘》-写真集-10P-
头条女神_蛋蛋Maccha《小女朋友》-写真集-40P-
头条女神_蛋蛋-罗丹《蛇腰诱惑》-写真集-37P-
头条女神_蜜蜜《塞纳湖畔》-写真集-15P-
头条女神_蜜蜜《大蜜范儿-豹纹比基尼》-写真集-23P-
头条女神_蜜蜜《恋上女老师》-写真集-26P-
头条女神_《西域湿娘》-写真集-15P-
头条女神_西希《爱神降临》-写真集-16P-
头条女神_西西《SAM-CAI》-写真集-14P-
头条女神_解斯童《海军情趣制服COS》-写真集-30P-
头条女神_解斯童《灌篮高手晴子美少女》-写真集-19P-
头条女神_解斯童《雪白尤物》-写真集-28P-
头条女神_诗卉《灌篮美少女》-写真集-25P-
头条女神_诗卉《知性美人-高冷美艳少女》-写真集-20P-
头条女神_语溪《一字美屄》-写真集-11P-
头条女神_语溪《人妻美体-熟女研究》-写真集-21P-
头条女神_赵灵儿《天生妙物》-写真集-24P-
头条女神_赵灵儿《姐妹花-少女爱抚》-写真集-22P-
头条女神_轩伊《白纱圣女》-写真集-17P-
头条女神_轩伊《皮衣朋克-SM快感》-VIP专享-写真集-19P-
头条女神_轩伊《马甲与乳-哥特式拘禁》-写真集-20P-
头条女神_迪依《绝伦美职娘-OL性感小秘书》-写真集-25P-
头条女神_迪爱儿《星彩女郎-星条衣幻彩》-写真集-11P-
头条女神_迪爱儿《波涛跨栏背心》-写真集-22P-
头条女神_迪爱儿《雨衣修水》-写真集-44P-
头条女神_郭婉婷《优雅骑手》-写真集-14P-
头条女神_郭婉婷《婉约红菱》-写真集-25P-
头条女神_郭婉婷《拳击与美女》-写真集-35P-
头条女神_郭婉婷《马场青春》-写真集-14P-
头条女神_郭忆然《纯白年代-白丝袜》-写真集-25P-
头条女神_郭美美-K8傲娇萌萌《成人街霸-春丽COPY》-写真集-22P-
头条女神_金圣雪《性感白色透视白连身裙》-写真集-33P-
头条女神_金圣雪-林亭音《绝伦仙女-性感内衣选片》-写真集-18P-
头条女神_金圣雪《空谷佳人-性感空姐》-写真集-25P-
头条女神_金子《单眼皮女孩》-写真集-12P-
头条女神_钟晴《我是你的小晴子》--写真集-9P-
头条女神_钟晴《我的死库水》-写真集-12P-
头条女神_锦葵《美人秘书》-写真集-28P-
头条女神_阳阳-大阳《性感巨乳女帝》-写真集-44P-
头条女神_阿依努尔瓦娅《公主恋人》-写真集-20P-
头条女神_阿依努尔瓦娅《公主驾到》-写真集-19P-
头条女神_阿依努尔瓦娅《瓦娅的秘密》-写真集-23P-
头条女神_阿狐nono《狐仙小女友》-写真集-27P-
头条女神_阿童木《百合湿身》-写真集-26P-
头条女神_阿芙罗拉-amp-amp-amp-叶卡捷琳娜《国庆特刊》-写真集-15P-
头条女神_阿芙罗拉《俄罗斯外模-妖精的旋律》-写真集-23P-
头条女神_陈亦菲《冰雪素人-豆蔻花颜》-写真集-24P-
头条女神_陈亦菲《卿本佳人》完整版-写真集-56P-
头条女神_陈亦菲《究极美腿杀》-写真集-27P-
头条女神_陈圆圆-李媛媛《王妃视感》-写真集-37P-
头条女神_陈夕《月牙弯弯-画中人》-写真集-17P-
头条女神_陈宇曦《纯爱情人-皮泳衣黑丝》-写真集-24P-
头条女神_陈宇曦《诱惑巨臀-白色高叉泳衣》-写真集-26P-
头条女神_陈宇曦《魅惑女神2》-写真集-25P-
头条女神_陈宇曦《黑丝湿乐园》-写真集-24P-
头条女神_陈宇熙《等爱的玫瑰-黑丝湿乐园-》-写真集-29P-
头条女神_陈宇熙-陈宇曦《妩媚女神-诱惑情趣内衣》-写真集-21P-
头条女神_陈怡曼COCO《泡泡物语-浴缸小清新》-写真集-22P-
头条女神_陈怡曼《人性的本能-解放天性内衣》-写真集-25P-
头条女神_陈怡曼《欲水四漫》-VIP专享-写真集-24P-
头条女神_陈怡曼《笼中快感-古装高叉旗袍》-写真集-20P-
头条女神_陈美琳《皇家派对-丝滑肉感》-写真集-16P-
头条女神_陈迪娅《摇曳花骨-洲际浴缸》-写真集-21P-
头条女神_陈迪娅《童贞少女》-写真集-32P-
头条女神_雨墨《money》-写真集-9P-
头条女神_雨燕《校花诱惑》-写真集-22P-
头条女神_雨燕《梦之湿身-燕儿如沙沙》-写真集-33P-
头条女神_雨燕《百合风韵诱惑》-写真集-20P-
头条女神_雪娇《和式浴袍》-写真集-25P-
头条女神_雪娇《玲珑宝贝美腿物语》-写真集-45P-
头条女神_雪娇《美腿美足征服》-写真集-30P-
头条女神_霍霍《性感保时捷女郎》-写真集-20P-
头条女神_霍霍《青春爵士活力》-写真集-10P-
头条女神_韩夏汐《极致露出》-写真集-89P-
头条女神_韩夏熙《极致蜕变》-写真集-14P-
头条女神_韩子萱《性感小兔子》-写真集-39P-
头条女神_韩子萱《欧洲杯特刊之法国宝贝》-写真集-14P-
头条女神_韩恩熙-夏雨涵《姐妹情深》-写真集-13P-
头条女神_韩秀冉《舞动灵魂》-写真集-26P-
头条女神_韵竹《风韵佳人》--写真集-21P-
头条女神_飞飞《我想和你虚度时光》-写真集-39P-
头条女神_饭岛小爱《人间の绘画》-写真集-21P-
头条女神_馨儿《学妹思春期》-写真集-27P-
头条女神_马丽华-Amanda无敌美辣妈《恶魔魅世》-写真集-23P-
头条女神_高萌萌《乳神归来》-VIP特辑-写真集-45P-
头条女神_高韩菲《曼琳少女》-写真集-9P-
头条女神_麦婕Maggie《悦目佳人-粉黛玉状》-写真集-16P-
头条女神_麦苹果《等你回来-清纯学生妹》-VIP特辑-写真集-23P-
头条女神_麦苹果《透视高叉》-写真集-27P-
头条女神_黎安雅《飞天小女警》-写真集-10P-
头条女神_黛斯羽《最美黑丝米兰达》-VIP专享-写真集-34P-
EOF;


$folder_full_path = isset($argv[1]) ? $argv[1] : null;

if(empty($folder_full_path)) {
    echo "---- Must have a full folder path as the param! \n";
    exit;
}

$dryrun = 0;
$org_name = '头条女神';
$org_name_en = 'TouTiao';

$scan = scandir($folder_full_path);
foreach($scan as $folder_name) {
   if (is_dir("$folder_full_path/$folder_name") && $folder_name!='.' && $folder_name!='..' ) {
        $origin_full_path = "$folder_full_path/$folder_name";
        echo "------------------------- \n";
        echo "-- Current folder: $folder_name \n";
        // Get cuurent folder vol number
        $l_folder_name = strtolower($folder_name);
        $l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
        $l_folder_name = str_replace('[toutiao头条女神]', 'toutiao头条女神 ', $l_folder_name);
        $y = find_between($l_folder_name, '[', ']');
        if(!empty($y[0])) {
            $l_folder_name = trim(str_replace('['.$y[0].']', '', $l_folder_name));
        }
        echo "---- $l_folder_name \n";
        $v_arr = explode(' ', $l_folder_name);
        $date = $v_arr[1];
        $vol = trim($v_arr[2]);
        $c = strlen($vol);
        // echo $vol . "\n";
        // echo $c ."\n"; exit;
        if($c > 6) {
            if(str_contains($vol,'-')) {
                $aa = explode('-', $vol);
                $vol = $aa[0];
                $m_model = $aa[1];
            }
            else {
                $m_model = $v_arr[3];
            }
        }
        else {
            $vol = 'nothing_to_match';
            $m_model = 'noone_to_match';
        }

        // $vol = 'no.'.$vol;
        // Go to origin path to get folder name with the same vol num
        $origin = getOriginFolderByVol($vol, $m_model);
        echo print_r($origin,1) . "\n"; 
        
        if(!empty($origin)) {
            // copy desc.txt and tags.txt from origin folder
            $desc_str = file_get_contents($origin['full_path'] . "/desc.txt");
            $desc_str = str_replace(' 生日','生日', $desc_str);
            $pos = strpos($desc_str, '生日');
            if($pos !== false) {
                $c = $desc_str[$pos-1];
                if ($c != "\n" && $c != "\rn" && $c != "\r") {
                    $desc_str = str_replace('生日',"\n生日", $desc_str);
                }
            }
            $desc_str = str_replace(' 罩杯','罩杯', $desc_str);
            $pos = strpos($desc_str, '罩杯');
            if($pos !== false) {
                $c = $desc_str[$pos-1];
                if ($c != "\n" && $c != "\rn" && $c != "\r") {
                    $desc_str = str_replace('罩杯',"\n罩杯", $desc_str);
                }
            }
            echo "Processing " . $origin_full_path . "/desc.txt \n";
            if(!$dryrun) file_put_contents($origin_full_path.'/desc.txt', $desc_str);
            
            // copy($origin['full_path'] . "/tags.txt", $origin_full_path . "/tags.txt");

            // Gen new tags
            $tags_str = file_get_contents($origin['full_path'] . "/tags.txt");
            $tags = explode(',', $tags_str);
            if(! in_array($org_name_en, $tags) && ! in_array(strtolower($org_name_en), $tags)) {
                $tags[] = $org_name_en;
            }
            if(! in_array( $org_name, $tags ) ) {
                $tags[] = $org_name;
            }
            if(! in_array( $origin['model'], $tags ) ) {
                $tags[] = $origin['model'];
            }
            $new_tags_str = implode(',', $tags);
            $new_tags_str = str_replace(strtolower($org_name_en), $org_name_en, $new_tags_str);
            echo "---- New tags: $new_tags_str \n";
            // create tags.txt
            echo "file_put_contents($origin_full_path/tags.txt, $new_tags_str) \n";
            if(!$dryrun) file_put_contents($origin_full_path.'/tags.txt', $new_tags_str);

            // create a new empty dl.txt in current folder
            echo "file_put_contents($origin_full_path/dl.txt, '') \n";
            if(!$dryrun) file_put_contents($origin_full_path.'/dl.txt', '');

            // Handle thumbnail.jpg
            $scan2 = scandir($origin_full_path);
            $images = [];
            $already_has_thumbnail = false;
            foreach($scan2 as $file) {
                $origin_file_full = $origin_full_path . '/' . $file;
                if(strpos($file, '本套图来自') !== false) {
                    unlink($origin_file_full);
                }
                if(strpos($file, '更多百度搜索') !== false) {
                    unlink($origin_file_full);
                }
                if(strpos($file, '永久地址') !== false) {
                    unlink($origin_file_full);
                }
                if($file == 'cover.jpg' || $file == 'cover.JPG') {
                    rename($origin_file_full, $origin_full_path . '/thumbnail.jpg');
                    $file = 'thumbnail.jpg';
                }
                if($file == 'thumbnail.JPG') {
                    rename($origin_file_full, $origin_full_path . '/thumbnail.jpg');
                    $file = 'thumbnail.jpg';
                }
                if($file == 'thumbnail.jpg') $already_has_thumbnail = true;
                if(!$already_has_thumbnail) {
                    if ( is_file($origin_file_full) && @is_array(getimagesize($origin_file_full)) ) {
                        $images[] = $file;
                    }
                }
            }
            if($already_has_thumbnail) {
                echo "---- Already has a thumbnail.jpg \n\n";
            }
            else {
                natsort($images);
                // Get first portrait image
                $thumb = $images[0];
                foreach ($images as $im) {
                    if(isImagePortrait($origin_full_path.'/'.$im)) {
                        $thumb = $im;
                        break;
                    }
                }
                
                // //$thumb = $images[count($images) - 1];

                // echo 'rename('. $origin_full_path . '/' . $thumb . ', ' . $origin_full_path . '/thumbnail.jpg' .  "\n\n";
                // rename($origin_full_path . '/' . $thumb , $origin_full_path . '/thumbnail.jpg');    

                echo 'copy('. $origin_full_path . '/' . $thumb . ', ' . $origin_full_path . '/thumbnail.jpg' .  "\n\n";
                copy($origin_full_path . '/' . $thumb , $origin_full_path . '/thumbnail.jpg');    
            }

            // rename current folder to the origin folder name
            if(!empty($origin['main'] )) {
                // $x = explode(' ', $folder_name);
                // $x = find_between($folder_name, ']', ' ');
                // $last = $x[0];
                $last = empty($last) ? '' : '-'.$last;

                // $vol = str_replace('no.', '', $vol);
                // $new_folder_name = $org_name_en.$org_name.'-'. strtoupper($origin_vol) . '-' . $origin['model'] . '-' . $origin['main'] . $last;
                // $new_folder_name = $org_name_en.$org_name.'-'. strtoupper($vol) . '-' . $origin['main'];
                $new_folder_name = $org_name_en.$org_name.'-'. $date . '-' . $origin['model'] . '-' . $origin['main'];
                echo "rename $origin_full_path to $folder_full_path/$new_folder_name\n\n";
                if(!$dryrun) rename($origin_full_path, $folder_full_path . '/'.$new_folder_name);
                echo "delete ori-folder: rm -rf '".$origin['full_path']."' \n";
                if(!$dryrun) system("rm -rf '".$origin['full_path']."'");

                // $desc = str_replace('-', ' ', $new_folder_name);
                // $desc .= '。欢迎下载高清无水印套图。';
                // echo "Processing " . $origin_full_path . "/desc.txt \n";
                // if(!$dryrun) file_put_contents($folder_full_path . '/'.$new_folder_name.'/desc.txt', $desc);
            }
            
            
        }
        else {
            echo "-- Cannot find mapped folder ...\n";
        }
   }
}



function getOriginFolderByVol($vol_num, $m_model) {
    global $dirs;
    
    global $org_name;
    
    // $vol_num = '-'.strtolower($vol_num).'-';
    
    // $origin_folders = '/mnt/nas/jw-photos/tujigu/' . $org_name;
    $origin_folders = '/home/eric/work/000/头条女神/';
    // $scan = scandir($origin_folders);
    $scan = explode("\r\n", $dirs);

    $folder_info = [];
    
    foreach($scan as $folder_name) {      
        // echo "folder: $folder_name \n";  
        
        $l_folder_name = strtolower($folder_name);
        $l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
        // echo "l_folder: $l_folder_name \n"; 
        // echo "vol_num: $vol_num \n"; 
        // exit;
        if(strpos($l_folder_name, $vol_num) !== false && strpos($l_folder_name, $m_model) !== false) {
            $folder_info['full_path'] = $origin_folders  . '/' . $folder_name;

            $l_folder_name = sanatizeCN($l_folder_name);
            $l_folder_name = str_replace('_-','_',$l_folder_name);
            $l_folder_name = str_replace('《','-',$l_folder_name);
            $l_folder_name = str_replace('》','-',$l_folder_name);
            $l_folder_name = str_replace('---','-',$l_folder_name);
            $l_folder_name = str_replace('--','-',$l_folder_name);
            $folder_info['name'] = $l_folder_name;

            $l_folder_name = mapModelNames($l_folder_name);
            $l_folder_name = str_replace($org_name.'-',$org_name.'_', $l_folder_name);
            
            $tt = find_between($l_folder_name, $org_name.'_', '-');
            if(str_starts_with($tt[0], 'n')) {
                $ss = find_between($l_folder_name, '-', '-');
                $folder_info['model'] = my_mb_ucfirst(sanatizeCN($ss[0]));
            }
            else {
                $xx = find_between($l_folder_name, $org_name.'_', '-');
                $folder_info['model'] = my_mb_ucfirst(sanatizeCN($xx[0]));
                //$yy = find_between($l_folder_name, $org_name.'_', '-no');
                
            }
            $folder_info['model'] = str_replace('YUmi尤美', 'Yumi尤美', $folder_info['model']);


            if(strpos($folder_name, '《') !== false) {
                $yy = find_between($folder_name, '《', '》');
                $main = empty($yy[0]) ? '' : trim($yy[0], '-');
            }
            else {
                $yy = find_between($folder_name, '---', '-');
                $main = empty($yy[0]) ? '' : trim($yy[0], '-');
            }
            if(empty($main)) {
                $xx = explode('-', $folder_name);
                $main = $xx[2];
            }
            $main = empty($main) ? '' : '《' .my_mb_ucfirst(sanatizeCN($main))  . '》';
            $folder_info['main'] = $main;
            break;
        }
    }

    return $folder_info;
}
