<?php
require('../../bootstrap.inc.php');

$dirs = <<<EOF
喵糖映画_《COS白发魔女》-VOL.020-写真集-40P-
喵糖映画_《COS萌妹》-VOL.018-写真集-40P-
喵糖映画_-HML.001-《新春旗袍》-写真集-24P-
喵糖映画_-HML.002-《旗袍狐耳》-写真集-32P-
喵糖映画_-HML.003-《大凤旗袍》-写真集-20P-
喵糖映画_-HML.004-水淼《大凤旗袍》-写真集-40P-
喵糖映画_-HML.005-《爱宕旗袍》-写真集-20P-
喵糖映画_-HML.006-《狂三旗袍》-写真集-22P-
喵糖映画_-HML.007-《高雄旗袍》-写真集-20P-
喵糖映画_-HML.008-《旗袍艾米莉亚》-写真集-42P-
喵糖映画_-HML.009-《银丝旗袍》-写真集-22P-
喵糖映画_-HML.010-《爱宕旗袍》-写真集-30P-
喵糖映画_-HML.011-《蜂糖花旗袍》-写真集-20P-
喵糖映画_-HML.012-《瓶儿旗袍》-写真集-25P-
喵糖映画_-HML.013-《小玉旗袍》-写真集-44P-
喵糖映画_-HML.014-《瓶儿旗袍》-写真集-47P-
喵糖映画_-HML.015-《高雄银红旗袍》-写真集-24P-
喵糖映画_-HML.016-《吾妻旗袍》-写真集-26P-
喵糖映画_-HML.017-《高雄白旗袍》-写真集-20P-
喵糖映画_-HML.018-《碧蓝大凤旗袍》-写真集-41P-
喵糖映画_-HML.019-《狂三黑丝旗袍》-写真集-31P-
喵糖映画_-HML.020-《八重樱旗袍》-写真集-31P-
喵糖映画_-HML.021-《綄溪沙旗袍》-写真集-20P-
喵糖映画_-HML.022-《公孙离旗袍》-写真集-20P-
喵糖映画_-HML.023-《玉玲珑旗袍》-写真集-27P-
喵糖映画_-HML.024-《玉藻狐旗袍》-写真集-33P-
喵糖映画_-HML.025-《瓶儿旗袍》-写真集-23P-
喵糖映画_-HML.026-《粉系旗袍》-写真集-21P-
喵糖映画_-HML.027-《黑色暗纹旗袍》-写真集-21P-
喵糖映画_-HML.028-《爱宕旗袍》-写真集-20P-
喵糖映画_-JKL.001-《制服少女》-写真集-35P-
喵糖映画_-JKL.002-《黑色JK》-写真集-50P-
喵糖映画_-JKL.003-《春季JK制服》-写真集-45P-
喵糖映画_-JKL.004-《学妹JK制服》-写真集-40P-
喵糖映画_-JKL.005-《水手JK制服》-写真集-42P-
喵糖映画_-JKL.006-《泳装JK制服》-写真集-43P-
喵糖映画_-JKL.007-《恶魔JK制服》-写真集-31P-
喵糖映画_-JKL.008-《夏季JK制服》-写真集-49P-
喵糖映画_-JKL.009-《粉格JK制服》-写真集-49P-
喵糖映画_-JKL.010-《白袜JK制服》-写真集-45P-
喵糖映画_-JKL.011-《水手JK制服》-写真集-39P-
喵糖映画_-JKL.012-《夏季校服JK制服》-写真集-48P-
喵糖映画_-JKL.013-《灰格JK制服》-写真集-63P-
喵糖映画_-JKL.014-《她・JK制服》-写真集-33P-
喵糖映画_-JKL.015-灰裙JK制服-45P-
喵糖映画_-JKL.016-《溪边JK制服》-写真集-37P-
喵糖映画_-JKL.017-《黑丝JK制服》-写真集-21P-
喵糖映画_-JKL.018-《户外JK制服》-写真集-54P-
喵糖映画_-JKL.019-猫耳JK制服-写真集-45P-
喵糖映画_-JKL.020-课室JK制服-写真集-25P-
喵糖映画_-JKL.021-天台JK制服-写真集-33P-
喵糖映画_-JKL.022-教室JK制服-写真集-39P-
喵糖映画_-JKL.023-双马尾JK制服-写真集-40P-
喵糖映画_-JKL.024-深蓝JK制服-写真集-40P-
喵糖映画_《JK制服少女》-VOL.013-写真集-40P-
喵糖映画_《JK制服少女》-VOL.098-写真集-44P-
喵糖映画_JK白丝-VOL.002-写真集-40P-
喵糖映画_-SPL.001-《双马尾私房》-写真集-40P-
喵糖映画_-SPL.002-《雷姆兔女郎》-写真集-41P-
喵糖映画_-SPL.003-《高雄兔女郎》-写真集-40P-
喵糖映画_-SPL.004-《爱宕旗袍》-写真集-39P-
喵糖映画_-SPL.005-《雷姆女仆》-写真集-40P-
喵糖映画_-SPL.006-《雷姆护士》-写真集-40P-
喵糖映画_-SPL.007-《灰灰狂三修》-写真集-44P-
喵糖映画_-SPL.008-《民俗白私房》-写真集-40P-
喵糖映画_-SPL.009-《犬JK》-写真集-40P-
喵糖映画_-SPL.010-《粉民俗JK》-写真集-40P-
喵糖映画_-SPL.011-《绿民俗JK》-写真集-40P-
喵糖映画_-SPL.012-《教室JK》-写真集-44P-
喵糖映画_-TML.001-半半子《兔女郎》-写真集-37P-
喵糖映画_-TML.002-《网袜兔女郎》-写真集-40P-
喵糖映画_-TML.003-《梦梦兔女郎》-写真集-53P-
喵糖映画_-TML.004-《秋山兔女郎》-写真集-61P-
喵糖映画_-TML.005-《麻衣兔女郎》-写真集-20P-
喵糖映画_-TML.006-《眠白兔女郎》-写真集-51P-
喵糖映画_-TML.007-《凉凉子兔女郎》-写真集-20P-
喵糖映画_-TML.008-《绘里兔女郎》-写真集-40P-
喵糖映画_-TML.009-《沫沫兔女郎》-写真集-40P-
喵糖映画_-TML.010-《加藤惠兔女郎》-写真集-25P-
喵糖映画_-TML.011-《麻衣学姐兔女郎》-写真集-20P-
喵糖映画_-TML.012-《蕾姆兔女郎》-写真集-26P-
喵糖映画_-TML.013-《加藤惠兔女郎》-写真集-29P-
喵糖映画_-TML.014-《蕾姆粉红兔女郎》-写真集-23P-
喵糖映画_-TML.015-《霞之丘兔女郎》-写真集-39P-
喵糖映画_-TML.016-《樱岛麻衣兔女郎》-写真集-26P-
喵糖映画_-TML.017-《圣人惠兔女郎》-写真集-23P-
喵糖映画_-TML.018-《加藤惠兔女郎》-写真集-20P-
喵糖映画_-TML.019-蕾姆兔女郎-写真集-23P-
喵糖映画_-TML.020-麻衣兔女郎-写真集-24P-
喵糖映画_-TML.021-麻衣兔女郎-写真集-38P-
喵糖映画_-VOL.131-《白色修女》-写真集-45P-
喵糖映画_-VOL.132-《碧海航线》-写真集-20P-
喵糖映画_-VOL.133-《小天鹅女仆和绊爱》-写真集-30P-
喵糖映画_-VOL.134-嶋葵《贪睡的嶋葵》-写真集-25P-
喵糖映画_-VOL.135-《清凉私房》-写真集-41P-
喵糖映画_-VOL.136-《真人猫猫女友》-写真集-40P-
喵糖映画_-VOL.137-《黑色礼服》-写真集-46P-
喵糖映画_-VOL.138-《花嫁》-写真集-40P-
喵糖映画_-VOL.139-《白色私房睡裙》-写真集-30P-
喵糖映画_-VOL.140-《白裙裸腿》-写真集-30P-
喵糖映画_-VOL.141-《和服之温泉》-写真集-27P-
喵糖映画_-VOL.142-《和服之哥特》-写真集-30P-
喵糖映画_-VOL.143-《日系白T私房》-写真集-35P-
喵糖映画_-VOL.144-《死库水之温泉》-写真集-30P-
喵糖映画_-VOL.145-《小草莓睡衣》-写真集-30P-
喵糖映画_-VOL.146-《三人女仆》-写真集-33P-
喵糖映画_-VOL.147-《白色泳装之温泉》-写真集-25P-
喵糖映画_-VOL.148-《女友的暖阳私房》-写真集-30P-
喵糖映画_-VOL.149-《粉色透明女仆》-写真集-21P-
喵糖映画_-VOL.150-《白色玛修》-写真集-40P-
喵糖映画_-VOL.151-《路人女友》-写真集-30P-
喵糖映画_-VOL.152-《啦啦少女之礼服》-写真集-28P-
喵糖映画_-VOL.153-《蓝白泳衣》-写真集-22P-
喵糖映画_-VOL.154-《黑丝猫耳娘》-写真集-40P-
喵糖映画_-VOL.155-《草莓印花小夜衣》-写真集-45P-
喵糖映画_-VOL.156-《爱宕花嫁》-写真集-32P-
喵糖映画_-VOL.157-《小恶魔女仆》-写真集-26P-
喵糖映画_-VOL.158-《纯白浴巾》-写真集-44P-
喵糖映画_-VOL.159-《居家女友》-写真集-25P-
喵糖映画_-VOL.160-《小恶魔黑裙》-写真集-31P-
喵糖映画_-VOL.161-《邻家女孩》-写真集-40P-
喵糖映画_-VOL.162-《夏日女友》-写真集-45P-
喵糖映画_-VOL.163-《单马尾死库水》-写真集-40P-
喵糖映画_-VOL.164-《黑色套装》-写真集-40P-
喵糖映画_-VOL.165-《智能型女友》-写真集-54P-
喵糖映画_-VOL.166-《单马尾女孩》-写真集-41P-
喵糖映画_-VOL.167-《浴缸泡泡》-写真集-41P-
喵糖映画_-VOL.168-《和泉纱雾》-写真集-50P-
喵糖映画_-VOL.169-《猫耳女仆》-写真集-36P-
喵糖映画_-VOL.170-《纯白私房》-写真集-76P-
喵糖映画_-VOL.171-《顾家的女友》-写真集-34P-
喵糖映画_-VOL.172-《白色死库水》-写真集-49P-
喵糖映画_-VOL.173-《她・白色长裙》-写真集-55P-
喵糖映画_-VOL.174-《-纯白浴巾》-写真集-58P-
喵糖映画_-VOL.175-《少女心事》-写真集-21P-
喵糖映画_-VOL.176-《半袖双马尾》-写真集-42P-
喵糖映画_-VOL.177-《白裙少女》-写真集-47P-
喵糖映画_-VOL.178-《猫系少女》-写真集-51P-
喵糖映画_-VOL.179-《粉色浴缸泡泡》-写真集-47P-
喵糖映画_-VOL.180-《加藤惠礼服》-写真集-26P-
喵糖映画_-VOL.181-《纯白精灵》-写真集-25P-
喵糖映画_-VOL.182-《白袜体操服》-写真集-50P-
喵糖映画_-VOL.183-《大凤礼服》-写真集-38P-
喵糖映画_-VOL.184-《粉系少女》-写真集-43P-
喵糖映画_-VOL.185-《草莓睡衣》-写真集-20P-
喵糖映画_-VOL.186-《纯白轻纱》-写真集-25P-
喵糖映画_-VOL.187-《白裙少女》-写真集-40P-
喵糖映画_-VOL.188-《粉色团子》-写真集-41P-
喵糖映画_-VOL.189-《粉系轻纱》-写真集-30P-
喵糖映画_-VOL.190-《娇妻厨娘》-写真集-20P-
喵糖映画_-VOL.191-《小天鹅女仆和礼服》-写真集-24P-
喵糖映画_-VOL.192-《黑猫女仆》-写真集-40P-
喵糖映画_-VOL.193-《兔耳女仆》-写真集-24P-
喵糖映画_-VOL.194-《胶衣女仆》-写真集-32P-
喵糖映画_-VOL.195-《可畏》-写真集-32P-
喵糖映画_-VOL.196-《复古私房》-写真集-28P-
喵糖映画_-VOL.197-《白裙轻纱》-写真集-50P-
喵糖映画_-VOL.198-《粉色睡裙》-写真集-30P-
喵糖映画_-VOL.199-《绵绵白T》-写真集-30P-
喵糖映画_-VOL.200-《黑猫与白兔》-写真集-25P-
喵糖映画_-VOL.201-《暖阳的海》-写真集-22P-
喵糖映画_-VOL.202-《OL制服裙》-写真集-70P-
喵糖映画_-VOL.203-《浴缸泳衣》-写真集-27P-
喵糖映画_-VOL.204-《纯白睡裙》-写真集-24P-
喵糖映画_-VOL.205-《长腿黑裙》-写真集-20P-
喵糖映画_-VOL.206-《吊带纱裙》-写真集-23P-
喵糖映画_-VOL.207-《白色体操服》-写真集-25P-
喵糖映画_-VOL.208-《白雪宝宝》-写真集-25P-
喵糖映画_-VOL.209-《男友的白衬衫》-写真集-48P-
喵糖映画_-VOL.210-《贝法红蓝礼服》-写真集-26P-
喵糖映画_-VOL.211-《小女友》-写真集-29P-
喵糖映画_-VOL.212-《家有女仆》-写真集-20P-
喵糖映画_-VOL.213-《爱宕花嫁》-写真集-20P-
喵糖映画_-VOL.214-《太郎死库水》-写真集-50P-
喵糖映画_-VOL.215-《和泉纱雾》-写真集-47P-
喵糖映画_-VOL.216-《蓝色条纹袜》-写真集-42P-
喵糖映画_-VOL.217-《粉色夏日》-写真集-40P-
喵糖映画_-VOL.218-《草莓妹妹》-写真集-45P-
喵糖映画_-VOL.219-《运动体操服》-写真集-50P-
喵糖映画_-VOL.220-《晌午暖阳》-写真集-48P-
喵糖映画_-VOL.221-《蓝色蕾姆》-写真集-30P-
喵糖映画_-VOL.222-《清凉体操服》-写真集-47P-
喵糖映画_-VOL.223-《黑色长裙》-写真集-40P-
喵糖映画_-VOL.224-《晚秋的原野》-写真集-39P-
喵糖映画_-VOL.225-《蓝色之夏》-写真集-21P-
喵糖映画_-VOL.226-《窗边女孩》-写真集-30P-
喵糖映画_-VOL.227-《体操白袜》-写真集-40P-
喵糖映画_-VOL.228-《穹妹白裙》-写真集-25P-
喵糖映画_-VOL.229-《捆绑花嫁》-写真集-38P-
喵糖映画_-VOL.230-《花溪纱》-写真集-20P-
喵糖映画_-VOL.231-《黑色死库水》-写真集-30P-
喵糖映画_-VOL.232-《居家女友》-写真集-32P-
喵糖映画_-VOL.233-《白衬死库水》-写真集-30P-
喵糖映画_-VOL.234-《和服少女》-写真集-25P-
喵糖映画_-VOL.235-《男友的白衬衫》-写真集-25P-
喵糖映画_-VOL.236-《纱雾妹妹》-写真集-27P-
喵糖映画_-VOL.237-《黑袜死库水》-写真集-46P-
喵糖映画_-VOL.238-《粉色浴缸》-写真集-32P-
喵糖映画_-VOL.239-《草莓泳衣》-写真集-40P-
喵糖映画_-VOL.240-《千丝万缕红》-写真集-39P-
喵糖映画_-VOL.241-《窗边的海》-写真集-30P-
喵糖映画_-VOL.242-《牛仔猫耳》-写真集-20P-
喵糖映画_-VOL.243-《加藤惠》-写真集-20P-
喵糖映画_-VOL.244-《蓝色厨娘》-写真集-33P-
喵糖映画_-VOL.245-《浴巾兔子》-写真集-40P-
喵糖映画_-VOL.246-《奶桃白白》-写真集-45P-
喵糖映画_-VOL.247-《加藤惠礼服》-写真集-20P-
喵糖映画_-VOL.248-《慵懒的阳光》-写真集-36P-
喵糖映画_-VOL.249-《蕾花睡衣》-写真集-49P-
喵糖映画_-VOL.250-《粉色披纱》-写真集-20P-
喵糖映画_-VOL.251-《纯纯的兔耳女友》-写真集-58P-
喵糖映画_-VOL.252-《草莓妹妹》-写真集-43P-
喵糖映画_-VOL.253-《大眼睛萌妹》-写真集-40P-
喵糖映画_-VOL.254-《粉系水手萌妹》-写真集-20P-
喵糖映画_-VOL.255-《浴缸里的兔子》-写真集-40P-
喵糖映画_-VOL.256-《户外小黄帽》-写真集-22P-
喵糖映画_-VOL.257-《夏日制服》-写真集-32P-
喵糖映画_-VOL.258-《麻衣穹妹》-写真集-27P-
喵糖映画_-VOL.259-《浴室体操服》-写真集-45P-
喵糖映画_-VOL.260-《居家女友》-写真集-35P-
喵糖映画_-VOL.261-《冬日里的暖阳》-写真集-20P-
喵糖映画_-VOL.262-《宅家妹妹》-写真集-39P-
喵糖映画_-VOL.263-《体操穹妹》-写真集-32P-
喵糖映画_-VOL.264-《午后阳光》-写真集-29P-
喵糖映画_-VOL.265-《春季暖阳》-写真集-36P-
喵糖映画_-VOL.266-《粉色夏日》-写真集-50P-
喵糖映画_-VOL.267-《夏日民宿》-写真集-27P-
喵糖映画_-VOL.268-《一只驯鹿酱》-写真集-23P-
喵糖映画_-VOL.269-《白色套装》-写真集-40P-
喵糖映画_-VOL.270-《OL制服》-写真集-20P-
喵糖映画_-VOL.271-纯色白裙-写真集-39P-
喵糖映画_-VOL.272-猫耳女友-写真集-24P-
喵糖映画_-VOL.273-白云森林-写真集-28P-
喵糖映画_-VOL.274-萌娘的蓝色毛衣-写真集-34P-
喵糖映画_-VOL.275-蓝色夏日-写真集-47P-
喵糖映画_-VOL.276-萌喵女友-写真集-34P-
喵糖映画_-VOL.277-毛衣少女-写真集-20P-
喵糖映画_-VOL.278-学院妹妹-写真集-35P-
喵糖映画_-VOL.279-夏日温泉-写真集-23P-
喵糖映画_-VOL.280-居家女友-写真集-20P-
喵糖映画_-VOL.281-空境-写真集-35P-
喵糖映画_-VOL.282-OL制服-写真集-29P-
喵糖映画_-VOL.283-纯情少女-写真集-44P-
喵糖映画_-VOL.284-花嫁-写真集-38P-
喵糖映画_-VOL.285-数之歌-写真集-30P-
喵糖映画_-VOL.286-白色体操服-写真集-20P-
喵糖映画_-VOL.287-少女心事-写真集-24P-
喵糖映画_-VOL.288-客厅少女-写真集-20P-
喵糖映画_-VOL.289-家有女仆-写真集-24P-
喵糖映画_-VOL.290-白色花嫁-写真集-21P-
喵糖映画_-VOL.291-OL制服-写真集-22P-
喵糖映画_-VOL.292-爱宕花嫁-写真集-20P-
喵糖映画_-VOL.293-红色眼镜娘-写真集-45P-
喵糖映画_-VOL.294-体操学妹-写真集-27P-
喵糖映画_-VOL.295-制服学妹-写真集-34P-
喵糖映画_-VOL.296-厨房猫娘-写真集-20P-
喵糖映画_-VOL.297-女仆独角兽-写真集-20P-
喵糖映画_-VOL.298-八重樱-写真集-37P-
喵糖映画_-VOL.299-中华风-写真集-20P-
喵糖映画_-VOL.300-秋季毛衣-写真集-49P-
喵糖映画_-VOL.301-宿醉-写真集-20P-
喵糖映画_-VOL.302-黑白修女-写真集-20P-
喵糖映画_-VOL.303-蓝色夏日-写真集-20P-
喵糖映画_-VOL.304-废弃教室-写真集-31P-
喵糖映画_-VOL.305-静夏白裙-写真集-34P-
喵糖映画_-VOL.306-海边姑娘-写真集-38P-
喵糖映画_-VOL.307-女仆长-写真集-20P-
喵糖映画_-VOL.308-红色体操服-写真集-44P-
喵糖映画_-VOL.309-蓝蝶静夏-写真集-25P-
喵糖映画_-VOL.310-水手少女-写真集-25P-
喵糖映画_-VOL.311-居家少女-写真集-20P-
喵糖映画_-VOL.312-泳池萌妹-写真集-35P-
喵糖映画_-VOL.313-职业OL-写真集-25P-
喵糖映画_-VOL.314-魔法少女-写真集-35P-
喵糖映画_-VOL.315-近距离恋爱-写真集-40P-
喵糖映画_-VOL.316-藤原千花-写真集-40P-
喵糖映画_-VOL.317-海棠女仆-写真集-21P-
喵糖映画_-VOL.318-起风了-写真集-26P-
喵糖映画_-VOL.319-画室少女-写真套图-23P-
喵糖映画_-VOL.320-浴缸泡泡-写真套图-28P-
喵糖映画_-VOL.321-蓝色私房-写真套图-20P-
喵糖映画_-VOL.322-天台少女-写真套图-46P-
喵糖映画_-VOL.323-浴缸泡泡-写真套图-20P-
喵糖映画_-VOL.324-贞德黑-写真套图-20P-
喵糖映画_-VOL.325-白色纱裙-写真套图-25P-
喵糖映画_-VOL.326-居家女友-写真套图-20P-
喵糖映画_-VOL.327-闺蜜情谊-写真套图-20P-
喵糖映画_-VOL.328-阿狸女郎-写真套图-25P-
喵糖映画_-VOL.329-小白裙-写真套图-22P-
喵糖映画_-VOL.330-窗台少女-写真套图-20P-
喵糖映画_-VOL.331-居家少女-写真套图-20P-
喵糖映画_-VOL.332-白裙穹妹-写真套图-30P-
喵糖映画_-VOL.333-兔耳女生-写真套图-20P-
喵糖映画_-VOL.335-夏日和风-写真套图-27P-
喵糖映画_-VOL.336-黑裙酒馆-写真套图-20P-
喵糖映画_-VOL.337-雷姆睡裙-写真套图-26P-
喵糖映画_-VOL.338-蔷薇少女-写真套图-24P-
喵糖映画_-VOL.339-肥宅凌波-写真套图-20P-
喵糖映画_-VOL.340-同桌的水手服-写真套图-33P-
喵糖映画_-VOL.341-圣诞女郎-写真套图-20P-
喵糖映画_-VOL.342-圣诞节-写真套图-33P-
喵糖映画_-VOL.343-白色睡衣-写真套图-25P-
喵糖映画_-VOL.344-死库水-写真套图-22P-
喵糖映画_-VOL.345-爱宕花嫁-写真套图-20P-
喵糖映画_-VOL.346-兔耳娘-写真套图-25P-
喵糖映画_-VOL.347-眼镜娘-写真套图-26P-
喵糖映画_-VOL.348-猫儿女仆-写真套图-22P-
喵糖映画_-VOL.349-居家JK制服-写真套图-20P-
喵糖映画_-VOL.350-八重樱-写真套图-33P-
喵糖映画_-VOL.351-泡泡粉裙-写真套图-22P-
喵糖映画_-VOL.352-女仆女友-写真套图-22P-
喵糖映画_-VOL.353-体操服-写真套图-50P-
喵糖映画_-VOL.354-蓝裙蝶-写真套图-20P-
喵糖映画_-VOL.355-湿润微凉-写真套图-35P-
喵糖映画_-VOL.356-蝴蝶结女仆-写真套图-37P-
喵糖映画_-VOL.357-少女前线-写真套图-32P-
喵糖映画_-VOL.358-杨玉环-写真套图-28P-
喵糖映画_-VOL.359-纱雾和白猫-写真套图-22P-
喵糖映画_-VOL.360-JK西装-写真套图-38P-
喵糖映画_-VOL.361-夏日沐浴-写真套图-35P-
喵糖映画_-VOL.363-牛仔小性感-写真套图-20P-
喵糖映画_-VOL.364-浴室JK-写真套图-21P-
喵糖映画_《丝袜酷女孩》-VOL.093-写真集-41P-
喵糖映画_《你可能得了喜欢我的病》-VOL.072-写真集-42P-
喵糖映画_《俏皮小护士》-VOL.076-写真集-40P-
喵糖映画_《兔子美少女》-VOL.055-写真集-44P-
喵糖映画_《兔耳家居服》-VOL.096-写真集-47P-
喵糖映画_《冬日毛衣》-VOL.101-写真集-40P-
喵糖映画_《制服下的死水库》-VOL.064-写真集-38P-
喵糖映画_《制服黑三本》-VOL.042-写真集-41P-
喵糖映画_《剑道少女》-VOL.008-写真集-41P-
喵糖映画_《卡哇伊》-VOL.031-写真集-40P-
喵糖映画_《双马尾学妹》-VOL.094-写真集-40P-
喵糖映画_《双马尾少女》-VOL.011-写真集-41P-
喵糖映画_《双马尾死水库》-VOL.097-写真集-47P-
喵糖映画_《可乐与薯片是绝配》-VOL.024-写真集-41P-
喵糖映画_《可爱喵娘》-VOL.045-写真集-40P-
喵糖映画_《和风少女》-VOL.039-写真集-40P-
喵糖映画_《喵喵的白丝水手服》-VOL.067-写真集-46P-
喵糖映画_《大眼JK妹》-VOL.010-写真集-40P-
喵糖映画_《女仆兽耳娘》--VOL.107-写真集-40P-
喵糖映画_《女仆和兔女郎》-VOL.092-写真集-30P-
喵糖映画_《女仆喵》-VOL.051-写真集-39P-
喵糖映画_《女仆眼镜娘》-VOL.120-写真集-36P-
喵糖映画_《女仆长裙》--VOL.108-写真集-30P-
喵糖映画_《妹妹这么可爱》-VOL.054-写真集-39P-
喵糖映画_《婚纱爱宕》-VOL.100-写真集-40P-
喵糖映画_《婚纱爱宕》--VOL.115-写真集-30P-
喵糖映画_《学妹丝语》-VOL.034-写真集-37P-
喵糖映画_《小黄帽女孩》-VOL.070-写真集-48P-
喵糖映画_《小黄鸭与白丝》-VOL.009-写真集-43P-
喵糖映画_《康娜酱雷姆》-VOL.037-写真集-39P-
喵糖映画_《惠的礼服》-VOL.059-写真集-40P-
喵糖映画_《护士小姐姐》-VOL.071-写真集-40P-
喵糖映画_《放学后来约会吧》-VOL.078-写真集-44P-
喵糖映画_《文静学妹》-VOL.004-写真集-40P-
喵糖映画_《旗袍半截袜》-VOL.066-写真集-41P-
喵糖映画_《无邪的笑容》-VOL.006-写真集-37P-
喵糖映画_《日系粉色JK》-VOL.087-写真集-41P-
喵糖映画_《日系萌妹》-VOL.014-写真集-43P-
喵糖映画_星野《兔女郎》-VOL.090-写真集-47P-
喵糖映画_《是雷姆呀》-VOL.043-写真集-41P-
喵糖映画_《最爱体操服》--VOL.106-写真集-40P-
喵糖映画_《桃子的睡衣》-VOL.085-写真集-44P-
喵糖映画_《梦梦兔女郎》-VOL.057-写真集-41P-
喵糖映画_《棕色女仆装》-VOL.124-写真集-61P-
喵糖映画_《棕色透明女仆》-VOL.125-写真集-47P-
喵糖映画_《楚楚动人的女友》-VOL.130-写真集-57P-
喵糖映画_氧气少女-VOL.003-写真集-86P-
喵糖映画_《泡泡球死库水》-VOL.046-写真集-40P-
喵糖映画_《狂三兔女郎》-VOL.083-写真集-40P-
喵糖映画_《猫儿萝莉》-VOL.103-写真集-38P-
喵糖映画_《猫耳女仆》-VOL.049-写真集-41P-
喵糖映画_《猫耳女仆装》-VOL.084-写真集-40P-
喵糖映画_《猫耳朵》-VOL.040-写真集-39P-
喵糖映画_《甜心小萝莉》-VOL.058-写真集-35P-
喵糖映画_《甜甜的女友》-VOL.126-写真集-40P-
喵糖映画_《甜甜的小麋鹿》-VOL.095-写真集-39P-
喵糖映画_《男友的衬衣》-VOL.022-写真集-38P-
喵糖映画_《男友衬衫》-VOL.061-写真集-40P-
喵糖映画_《白丝JK学妹》-VOL.121-写真集-47P-
喵糖映画_《白丝双马尾》-VOL.065-写真集-40P-
喵糖映画_《白丝宅T》--VOL.113-写真集-38P-
喵糖映画_《白丝格子裙少女》-VOL.015-写真集-43P-
喵糖映画_《白丝猫耳》-VOL.027-写真集-41P-
喵糖映画_《白发魔女》-VOL.017-写真集-40P-
喵糖映画_《白浴缸死水库》-VOL.075-写真集-39P-
喵糖映画_《白纱裙》-VOL.069-写真集-44P-
喵糖映画_《白色兔女郎》-VOL.041-写真集-42P-
喵糖映画_《白色の物语》-VOL.025-写真集-42P-
喵糖映画_《白色睡衣》-VOL.056-写真集-45P-
喵糖映画_《短裙喵耳》-VOL.116-写真集-39P-
喵糖映画_《私房双人猫耳》-VOL.128-写真集-43P-
喵糖映画_《私房浴缸》-VOL.088-写真集-23P-
喵糖映画_《私房物语》-VOL.091-写真集-37P-
喵糖映画_《私房白袜》-VOL.086-写真集-40P-
喵糖映画_《穹妹和服》-VOL.105-写真集-39P-
喵糖映画_《穹妹女仆》-VOL.082-写真集-42P-
喵糖映画_《粉格裙的眼睛娘》-VOL.077-写真集-44P-
喵糖映画_《粉红护士》-VOL.033-写真集-48P-
喵糖映画_《粉色JK小姐姐》-VOL.074-写真集-49P-
喵糖映画_《粉色吊带睡衣》-VOL.104-写真集-45P-
喵糖映画_《粉色猫耳女仆》-VOL.119-写真集-34P-
喵糖映画_《索尼子和服》--VOL.109-写真集-33P-
喵糖映画_《索尼子的热情》-VOL.050-写真集-35P-
喵糖映画_《红色系》-VOL.038-写真集-42P-
喵糖映画_《纱雾》-VOL.048-写真集-39P-
喵糖映画_《网袜兔女郎》-VOL.044-写真集-40P-
喵糖映画_《网袜兔女郎》-VOL.080-写真集-40P-
喵糖映画_《艾米莉亚》-VOL.062-写真集-40P-
喵糖映画_《艾米莉亚的日常》-VOL.052-写真集-45P-
喵糖映画_《花嫁cos》-VOL.123-写真集-40P-
喵糖映画_《花嫁》-VOL.029-写真集-43P-
喵糖映画_《花样的年华》-VOL.007-写真集-40P-
喵糖映画_《蓝白梦幻少女》-VOL.019-写真集-46P-
喵糖映画_《蓝白死库水少女》-VOL.016-写真集-40P-
喵糖映画_《蓝白水手服少女》-VOL.012-写真集-43P-
喵糖映画_《蓝色兔子》-VOL.053-写真集-41P-
喵糖映画_《蓝色女仆》-VOL.122-写真集-43P-
喵糖映画_《蓝色死库水》-VOL.036-写真集-41P-
喵糖映画_《蕾丝吊带》-VOL.063-写真集-40P-
喵糖映画_《蕾丝荷叶边泳衣》-VOL.102-写真集-40P-
喵糖映画_《蕾姆睡衣》--VOL.112-写真集-30P-
喵糖映画_《裸腿制服裙》-VOL.047-写真集-44P-
喵糖映画_《诗羽兔女郎》--VOL.111-写真集-25P-
喵糖映画_过膝白丝-VOL.001-写真集-41P-
喵糖映画_《透明女仆》--VOL.117-写真集-50P-
喵糖映画_《透明薄纱》-VOL.028-写真集-40P-
喵糖映画_《酒吞女仆》-VOL.129-写真集-41P-
喵糖映画_《长发JK萌妹》-VOL.023-写真集-44P-
喵糖映画_《长腿眼镜娘》--VOL.110-写真集-43P-
喵糖映画_《阳光下的白泳衣》-VOL.099-写真集-45P-
喵糖映画_《阳光宅女》-VOL.068-写真集-39P-
喵糖映画_《露肩睡裙》-VOL.118-写真集-40P-
喵糖映画_《露背毛衣》-VOL.030-写真集-39P-
喵糖映画_《露背毛衣》-VOL.089-写真集-40P-
喵糖映画_《青涩的性感》-VOL.005-写真集-34P-
喵糖映画_《高跟蕾丝网袜》-VOL.035-写真集-34P-
喵糖映画_《黄小鸭》-VOL.032-写真集-40P-
喵糖映画_《黑丝猫耳》-VOL.060-写真集-46P-
喵糖映画_《黑喵女友》-VOL.081-写真集-45P-
喵糖映画_《黑巫女仆》-VOL.127-写真集-40P-
喵糖映画_《黑白旗袍双子》--VOL.114-写真集-41P-
喵糖映画_《黑网袜红色兔女郎》-VOL.021-写真集-40P-
喵糖映画_《黑胶衣》-VOL.026-写真集-40P-
喵糖映画_《黑色制服的少女》-VOL.079-写真集-39P-
喵糖映画_《黑色高跟鞋》-VOL.073-写真集-38P-
EOF;


$folder_full_path = isset($argv[1]) ? $argv[1] : null;

if(empty($folder_full_path)) {
    echo "---- Must have a full folder path as the param! \n";
    exit;
}

$dryrun = 0;
$org_name = '喵糖映画';
$org_name_en = 'MTCos';

$scan = scandir($folder_full_path);
foreach($scan as $folder_name) {
   if (is_dir("$folder_full_path/$folder_name") && $folder_name!='.' && $folder_name!='..' ) {
        $the_full_path = "$folder_full_path/$folder_name";
        echo "------------------------- \n";
        echo "-- Current folder: $folder_name \n";
        // Get cuurent folder vol number
        $l_folder_name = strtolower($folder_name);
        $l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
        // $v_arr = explode(' ',$l_folder_name);
        $v_arr = find_between($l_folder_name, 'jkl.', ' ');
        $vol = 'jkl.'.$v_arr[0];

        // $vol = str_replace('no.', '', $vol);
        // Go to origin path to get folder name with the same vol num
        $origin = getOriginFolderByVol($vol);
        echo print_r($origin,1) . "\n"; 
        
        if(!empty($origin)) {
            // copy desc.txt and tags.txt from origin folder
            // $desc_str = file_get_contents($origin['full_path'] . "/desc.txt");
            // $desc_str = str_replace(' 生日','生日', $desc_str);
            // $pos = strpos($desc_str, '生日');
            // if($pos !== false) {
            //     $c = $desc_str[$pos-1];
            //     if ($c != "\n" && $c != "\rn" && $c != "\r") {
            //         $desc_str = str_replace('生日',"\n生日", $desc_str);
            //     }
            // }
            // $desc_str = str_replace(' 罩杯','罩杯', $desc_str);
            // $pos = strpos($desc_str, '罩杯');
            // if($pos !== false) {
            //     $c = $desc_str[$pos-1];
            //     if ($c != "\n" && $c != "\rn" && $c != "\r") {
            //         $desc_str = str_replace('罩杯',"\n罩杯", $desc_str);
            //     }
            // }
            // echo "Processing " . $the_full_path . "/desc.txt \n";
            // if(!$dryrun) file_put_contents($the_full_path.'/desc.txt', $desc_str);
            
            // copy($origin['full_path'] . "/tags.txt", $the_full_path . "/tags.txt");

            // Gen new tags
            $tags_str = file_get_contents($origin['full_path'] . "/tags.txt");
            $tags = explode(',', $tags_str);
            if(! in_array($org_name_en, $tags) && ! in_array(strtolower($org_name_en), $tags)) {
                $tags[] = $org_name_en;
            }
            if(! in_array( $org_name, $tags ) ) {
                $tags[] = $org_name;
            }
            // if(! in_array( $origin['model'], $tags ) ) {
            //     $tags[] = $origin['model'];
            // }
            if(! in_array( 'Cosplay', $tags ) ) {
                $tags[] = 'Cosplay';
            }
            $new_tags_str = implode(',', $tags);
            $new_tags_str = str_replace(strtolower($org_name_en), $org_name_en, $new_tags_str);
            echo "---- New tags: $new_tags_str \n";
            // create tags.txt
            echo "file_put_contents($the_full_path/tags.txt, $new_tags_str) \n";
            if(!$dryrun) file_put_contents($the_full_path.'/tags.txt', $new_tags_str);

            // create a new empty dl.txt in current folder
            echo "file_put_contents($the_full_path/dl.txt, '') \n";
            if(!$dryrun) file_put_contents($the_full_path.'/dl.txt', '');

            // // Handle thumbnail.jpg
            // $scan2 = scandir($the_full_path);
            // $images = [];
            // $already_has_thumbnail = false;
            // foreach($scan2 as $file) {
            //     $origin_file_full = $the_full_path . '/' . $file;
            //     if($file == 'cover.jpg') {
            //         rename($the_full_path . '/cover.jpg' , $the_full_path . '/thumbnail.jpg');
            //         $file = 'thumbnail.jpg';
            //     }
            //     if($file == 'thumbnail.jpg') $already_has_thumbnail = true;
            //     if ( is_file($origin_file_full) && @is_array(getimagesize($origin_file_full)) ) {
            //         $images[] = $file;
            //     }
            // }
            // natsort($images);
            
            // if($already_has_thumbnail) {
            //     echo "---- Already has a thumbnail.jpg \n\n";
            // }
            // else {
            //     // if((int)$vol < 37) {
            //     //   $thumb = $images[0];
            //     // }
            //     // else {
            //         $thumb = $images[count($images) - 1];
            //     // }
            //     echo 'rename('. $the_full_path . '/' . $thumb . ', ' . $the_full_path . '/thumbnail.jpg' .  "\n\n";
            //     if(!$dryrun) rename($the_full_path . '/' . $thumb , $the_full_path . '/thumbnail.jpg');    
            // }

            // rename current folder to the origin folder name
            if(!empty($origin['main'] )) {
                // $x = explode(' ', $folder_name);
                // $last = $x[1];
                
                //$new_folder_name = $org_name_en.$org_name.'-'. ucfirst($vol) . '-'.$origin['model'] . '-' . $origin['main'] . '-'.$last;
                $new_folder_name = $org_name_en.$org_name.'-'. ucfirst($vol) . '-' . $origin['main'];
                echo "rename $the_full_path to $folder_full_path/$new_folder_name\n\n";
                if(!$dryrun) rename($the_full_path, $folder_full_path . '/'.$new_folder_name);

                $desc = str_replace('-', ' ', $new_folder_name);
                $desc .= '。欢迎下载高清无水印套图。';
                echo "Processing " . $the_full_path . "/desc.txt \n";
                if(!$dryrun) file_put_contents($folder_full_path . '/'.$new_folder_name.'/desc.txt', $desc);
            }
            
            
        }
        else {
            echo "-- Cannot find mapped folder ...\n";
        }
   }
}



function getOriginFolderByVol($vol_num) {
    global $dirs;
    
    global $org_name;
    
    // echo "vol_num = $vol_num \n"; exit;
    
    $origin_folders = '/mnt/nas/jw-photos/tujigu/' . $org_name;
    // $scan = scandir($origin_folders);
    $scan = explode("\r\n", $dirs);

    $folder_info = [];
    
    foreach($scan as $folder_name) {      
        // echo "folder: $folder_name \n";  
        if (is_dir("$origin_folders/$folder_name") && $folder_name!='.' && $folder_name!='..') {

            $l_folder_name = strtolower($folder_name);
            //$l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
            // echo "l_folder: $l_folder_name \n";
            
            if(strpos($l_folder_name, $vol_num) !== false) {
                $folder_info['full_path'] = $origin_folders  . '/' . $folder_name;

                $l_folder_name = sanatizeCN($l_folder_name);
                $l_folder_name = str_replace('_-','_',$l_folder_name);
                $l_folder_name = str_replace('---','-',$l_folder_name);
                $l_folder_name = str_replace('--','-',$l_folder_name);
                $folder_info['name'] = $l_folder_name;

                $l_folder_name = mapModelNames($l_folder_name);
                

                // $tt = find_between($l_folder_name, $org_name.'_', '-');
                // if(str_starts_with($tt[0], 'no.')) {
                //     $ss = find_between($l_folder_name, '-', '-');
                //     $folder_info['model'] = my_mb_ucfirst(sanatizeCN($ss[0]));
                //     // Get "main"
                //     // $yy = find_between($l_folder_name, '-', 'p-');
                //     // $main_arr = explode('-', $yy[0]);
                //     // array_pop($main_arr);
                //     // $main = implode('-', $main_arr);
                //     // $folder_info['main'] = $main;
                //     // $folder_info['main'] = '';
                // }
                // else {
                //     $xx = find_between($l_folder_name, $org_name.'_', '-');
                //     $folder_info['model'] = my_mb_ucfirst(sanatizeCN($xx[0]));
                //     //$yy = find_between($l_folder_name, $org_name.'_', '-no');
                    
                // }
                // $folder_info['model'] = str_replace('YUmi尤美', 'Yumi尤美', $folder_info['model']);


                if(strpos($folder_name, '《') !== false) {
                    $yy = find_between($folder_name, '《', '》');
                    $main = empty($yy[0]) ? '' : trim($yy[0], '-');
                }
                else {
                    $yy = find_between($folder_name, '---', '-');
                    $main = empty($yy[0]) ? '' : trim($yy[0], '-');
                }
                if(empty($main)) {
                    $xx = explode('-', $folder_name);
                    $main = $xx[2];
                }
                $main = empty($main) ? '' : '《' .my_mb_ucfirst(sanatizeCN($main))  . '》';
                $folder_info['main'] = $main;
                continue;
            }
        }
    }

    return $folder_info;
}
