<?php
require('../../bootstrap.inc.php');

$dirs = <<<EOF
尤果网_5周年特辑《Let-amp-amp--039-s-Love》-T039-写真集-61P-
尤果网_Aleo《夏娃的诱惑》-U317-写真集-65P-
尤果网_Alin《阳光边缘-明媚笑脸》写真集-U100--64P-
尤果网_Amanda-amp-amp-萌琪琪-amp-amp-夏玲蔓-amp-amp-葵皇-amp-amp-萱宸《猎艳》-T036-写 真集-65P-
尤果网_Chelsea《如此千娇百媚，风情万种》-U422-写真集-62P-
尤果网_coco可可-U287-写真集-65P-
尤果网_COCO《香馥郁郁》-U402-写真集-65P-
尤果网_-E001-赵芊羽-赵雪--写真集-46P-
尤果网_-E002-许文婷-写真集-50P-
尤果网_-E003-加美-写真集-47P-
尤果网_-E004-纯小希-写真集-47P-
尤果网_-E005-诗朵雅-写真集-53P-
尤果网_-E006-紫妍-写真集-38P-
尤果网_-E007-星妤-写真集-29P-
尤果网_-E008-诗朵雅-II-写真集-44P-
尤果网_-E009-苏可可-写真集-59P-
尤果网_-E010-陈柳溪《小清新的性感》写真集-62P-
尤果网_-E011-杜乔-写真集-38P-
尤果网_-E012-张译文-写真集-58P-
尤果网_-E013-杜乔-II-写真集-54P-
尤果网_-E014-苏可可-II-写真集-57P-
尤果网_-E015-纯小希-II-写真集-56P-
尤果网_-E016-陈怡曼-写真集-69P-
尤果网_-E017-Anna-《人间胸器》写真集-64P-
尤果网_-E018-王轶玲-写真集-61P-
尤果网_-E019-赵芊羽-II-写真集-64P-
尤果网_-E020-田依依-写真集-28P-
尤果网_-E021-刘娅希-写真集-33P-
尤果网_-E022-南湘baby-写真集-31P-
尤果网_-E023-小潘鼠《呆萌萝莉，清纯可人》-写真集-35P-
尤果网_-E024-思涵《性感萝莉》-写真集-73P-
尤果网_-E025-颜瑜-写真集-31P-
尤果网_-E026-郭婉祈-写真集-29P-
尤果网_-E027-耶利米-写真集-34P-
尤果网_-E028-小九日日-写真集-37P-
尤果网_-E029-Candy三美-刘美辰-写真集-27P-
尤果网_-E030-群群-写真集-37P-
尤果网_-E031-金子熙《香艳薄纱丝袜》写真集-32P-
尤果网_-E032-曼苏拉娜-写真集-20P-
尤果网_-E033-苏迪-写真集-30P-
尤果网_-E034-诗朵雅《曲线诱惑》-写真集-37P-
尤果网_-E035-妮小妖《很妖很迷人的小妖公主》-写真集-33P-
尤果网_-E036-王幼贞《性感日系风》-写真集-35P-
尤果网_-E037-郭婉祈-II-写真集-28P-
尤果网_-E038-娜依灵儿-写真集-24P-
尤果网_-E039-王语纯《撩动宅男心扉的诱惑画面》-写真集-31P-
尤果网_-E040-绮里嘉《可爱清纯性感的双重诱惑》写真集-33P-
尤果网_-E041-娜依灵儿-II-写真集-34P-
尤果网_-E042-刘美辰-II-写真集-29P-
尤果网_-E043-长腿模特曾晨《夏日性感》写真集-35P-
尤果网_-E044-杨诺依《灵动兔女郎上演致命诱惑》写真集-29P-
尤果网_-E045-丁丁《黑丝兔女郎的透视诱惑》-写真集-29P-
尤果网_-E046-张冬《美艳私房》写真集-34P-
尤果网_-E047-郭铃茜《复古性感主题》写真集-30P-
尤果网_-E048-张栩菲《性感女神》-写真集-34P-
尤果网_-E049-研依《秋日性感》写真集-36P-
尤果网_-E050-Miko梦露-马欣悦《金发尤物》写真集-45P-
尤果网_-E051-金子熙《香肩酥胸长腿美女与豪车性感较量》-II-写真集-45P-
尤果网_-F001-马欣悦-Miko-写真集-35P-
尤果网_-F002-诗朵雅《宅男福利》写真集-39P-
尤果网_-F003-模特季节-写真集-34P-
尤果网_-F004-纯小希-金子熙-兮媛-《这个圣诞不会冷》-写真集-60P-
尤果网_-F005-周年特辑《匆匆一年》-写真集-37P-
尤果网_Jona《元宵节主题：上元春色》-T032-写真集-65P-
尤果网_Jona-娜木汗-Sunny《夏日比基尼》-T024-写真集-70P-
尤果网_Mary《惹火尤物-不舍昼夜》写真集-U108--59P-
尤果网_Merry-若彤-颜颜《甜蜜盛夏》-T033-写真集-65P-
尤果网_Miko兮媛《蕾丝半透-香艳诱惑》写真集-U087--46P-
尤果网_Orange《午后的甜橙》-U308-写真集-65P-
尤果网_Pinkbaby《恋爱般的甜蜜》-U330-写真集-65P-
尤果网_Rita《Rita的夏日约定》写真集-U097--52P-
尤果网_Shirley-U423-写真集-64P-
尤果网_Sora《日系校服少女日志》写真集-U142--67P-
尤果网_sukki可儿《贪玩的少女》-U264-写真集-65P-
尤果网_-T001-苏可可-纯小希-赵雪《2014世界杯足球宝贝特刊》-写真集-30P-
尤果网_-T002-颜瑜-刘娅希-小潘鼠《2014世界杯足球宝贝特刊-II》-写真集-30P-
尤果网_-T003-马欣悦-郭婉祈-沈紫薇《2014世界杯足球宝贝特刊-三-》-写真集-30P-
尤果网_-T004-曾晨-纯小希-沈紫薇《尤女神合辑一》-写真集-27P-
尤果网_-T005-研依-郭婉祈-美熙《Valentine-amp-rsquo-s-Day》-情人节特辑-写真集-37P-
尤果网_-T006-《春节增刊》福利-写真集-43P-
尤果网_-T007-纯小希-绮里嘉《春分》写真集-42P-
尤果网_-T008-《白色情欲-蛊惑人心》-写真集-59P-
尤果网_-T009-张栩菲-郝晴-刘美辰《狐狸精养成攻略》-写真集-26P-
尤果网_-T010-金子熙-黛蓓琪-朱赢《皮草合辑》写真集-58P-
尤果网_-T011-顾欣怡-刘美辰-朱赢-研依-金子熙-张冬-苏糯米《七夕典藏》-写真集-60P-
尤果网_-T012-梓安-李思宁-杨漫妮-未知模特《圣诞特辑》写真集-64P-
尤果网_-T013-2周年《想你的365天》-写真集-60P-
尤果网_-T014-谭晓彤-徐路-李灿兮《新春特辑》-写真集-61P-
尤果网_-T016-珞可可-Aling-张鑫《纯白之恋》写真集-63P-
尤果网_-T021-合辑-三周年-写真集-78P-
尤果网_Tina-amp-amp-amp-小兔《圣诞波》-T028-写真集-65P-
尤果网_Tina《超高颜值的小仙女》-U324-写真集-65P-
尤果网_Toya《爱情是一种解药》-U355-写真集-65P-
尤果网_-U052-朱赢《混血风情大片》写真集-34P-
尤果网_-U053-小可爱《萝莉有风险，扑倒需谨慎》-写真集-60P-
尤果网_-U054-妮小妖《东瀛风情与野性朋克的完美邂逅》写真集-54P-
尤果网_-U055-绮里嘉《江南风情的性感》写真集-58P-
尤果网_-U056-刘嘉琦cherry《宅男无法逃脱的诱惑》-写真集-65P-
尤果网_-U057-若熙《诱惑至极》写真集-44P-
尤果网_-U058-苏糯米-写真集-55P-
尤果网_-U059-纯小希-III-《诱人曲线》写真集-50P-
尤果网_-U060-Miko兮媛-写真集-64P-
尤果网_-U061-林妃媛-写真集-60P-
尤果网_-U062-张小西Ann-写真集-59P-
尤果网_-U063-郝晴Grace-写真集-53P-
尤果网_-U064-黛蓓琪-写真集-64P-
尤果网_-U065-游子熙-写真集-47P-
尤果网_-U066-张栩菲《终极诱惑》-II-写真集-12P-
尤果网_-U067-molly朱赢-II-写真集-64P-
尤果网_-U068-心儿-写真集-63P-
尤果网_-U069-三美-III-《娇小女生的性感》写真集-43P-
尤果网_-U070-佟蔓《无论何时都要美艳》写真集-40P-
尤果网_-U071-高冷女神郭婉祈《White-Day》-写真集-47P-
尤果网_-U072-韩雨菲《性感女秘书、邻家女娃、火红兔女郎》-写真集-61P-
尤果网_-U073-王瑞儿-二筒姐-写真集-58P-
尤果网_-U074-研依-II-《冰火两重天》写真集-65P-
尤果网_-U075-性感女王莫雨-写真集-34P-
尤果网_-U076-模特梦瑶-写真集-65P-
尤果网_-U077-娜依灵儿-III-写真集-45P-
尤果网_-U078-美熙《糖果色》写真集-57P-
尤果网_-U079-王语纯-II-《-amp-ldquo-欲-amp-rdquo-女与玉女》写真集-49P-
尤果网_-U081-苏可可-写真集-64P-
尤果网_-U101-王语纯-III-写真集-52P-
尤果网_-U102-模特笑笑-写真集-25P-
尤果网_-U104-模特COCO-写真集-45P-
尤果网_-U105-美熙-II-写真集-65P-
尤果网_-U107-精灵MiuMiu-写真集-60P-
尤果网_-U110-宇琦儿-写真集-55P-
尤果网_-U111-米妮-苏糯米--写真集-63P-
尤果网_-U113-赵伊彤-II-写真集-40P-
尤果网_-U115-雪儿《夏末最美的鲜花》写真集-62P-
尤果网_-U119-张熙儿《最想娶回家的大美女》写真集-29P-
尤果网_-U121-松果儿《中秋福利大片》写真集-52P-
尤果网_-U122-话题女神小欧-写真集-36P-
尤果网_-U123-霓梓心-写真集-53P-
尤果网_-U124-张辛苑《小小的性感-懵懂的初恋》写真集-74P-
尤果网_-U125-顾欣怡《美到流口水的小仙女》写真集-63P-
尤果网_-U126-梓安《不能冷艳的高贵》写真集-65P-
尤果网_-U129-混血女王陈宝拉-II-写真集-65P-
尤果网_-U130-王雨纯-Ⅳ-写真集-59P-
尤果网_-U133-人鱼小公举Vivi-写真集-35P-
尤果网_-U135-Dear梓安-写真集-65P-
尤果网_-U136-瑞宝《这领家女孩的秘密》写真集-50P-
尤果网_-U145-momo《金粉小萝莉》-写真集-64P-
尤果网_-U154-王雨纯《女香》写真集-58P-
尤果网_-U155-Bunny《可爱的小美女》写真集-64P-
尤果网_-U156-小吉《狂恋の小吉》写真集-65P-
尤果网_-U158-模特文静-写真集-57P-
尤果网_-U159-仙妮《画中仙子》写真集-65P-
尤果网_-U161-谭晓彤《心脏电击的体验》写真集-65P-
尤果网_-U162-Cheryl青树-李思宁《青柠之恋》写真集-65P-
尤果网_-U163-易阳《绝色香艳撑爆你的瞳孔》写真集-67P-
尤果网_-U165-叶赫那拉信悦《今夜注定难以入睡》写真集-62P-
尤果网_-U166-叶希《高傲又纯情的诱惑》写真集-65P-
尤果网_-U167-王瑞儿《心跳不已》写真集-65P-
尤果网_-U170-模特Enjoy-写真集-65P-
尤果网_-U171-于思琪《H20氢氧美人的滋润》写真集-57P-
尤果网_-U172-麦苹果《软玉温香-旖旎风光》写真集-64P-
尤果网_-U173-嫩模梓喵COS-写真集-65P-
尤果网_-U174-孟狐狸《-amp-ldquo-心-amp-rdquo-的体验》写真集-60P-
尤果网_-U175-青树《轻灵之气的美人》写真集-65P-
尤果网_-U176-欣杨Kitty《刺杀任务》-写真集-65P-
尤果网_-U177-逸染《初试香艳私房》写真集-65P-
尤果网_-U178-素衣-杨子惜《扑通扑通LOVE》写真集-65P-
尤果网_-U179-王莹《快来吃我吧》写真集-65P-
尤果网_-U180-李思宁《暴力美学-视觉诱惑大片》写真集-65P-
尤果网_-U181-陈雅漫《千年小妖》写真集-57P-
尤果网_-U182-夏倪可ella《幻想女友》写真集-65P-
尤果网_-U183-于思琪《性感与忧郁》写真集-65P-
尤果网_-U184-阿依努尔瓦娅《骨感少数民族美女》写真集-65P-
尤果网_-U185-空灵惑《卷发小萝莉-短发白富美》写真集-65P-
尤果网_-U186-模特春娇-写真集-64P-
尤果网_-U187-模特秦露-写真集-55P-
尤果网_-U188-王尔琳《无尽的香艳》写真集-65P-
尤果网_-U189-黛熙儿《黑色香艳》写真集-65P-
尤果网_-U190-金鑫大宝贝《定制恋人》写真集-65P-
尤果网_-U191-青树《诱惑小护士》写真集-65P-
尤果网_-U192-溪甜《山泉少女》写真集-65P-
尤果网_-U193-宅男女神香港小紫藤-写真集-65P-
尤果网_-U194-靳宝《禁欲系美臀》写真集-60P-
尤果网_-U195-才可儿《香艳制服》写真集-65P-
尤果网_-U196-尹凌儿《精灵一般的美人》写真集-65P-
尤果网_-U197-曲铭瑄-写真集-65P-
尤果网_-U198-童颜巨乳颜爱泽-写真集-65P-
尤果网_-U199-玲珑美人萌琪琪-写真集-64P-
尤果网_-U200-莉恩-写真集-60P-
尤果网_-U201-曾嘉琪-写真集-65P-
尤果网_-U202-文文《与你同在的夏天》写真集-65P-
尤果网_-U203-颜美汐《好诱惑的人》写真集-65P-
尤果网_-U204-小仙女顾籼-写真集-65P-
尤果网_-U205-香川颖《水蜜桃般的诱惑》写真集-65P-
尤果网_-U206-飞Angelababy-穆菲菲-写真集-65P-
尤果网_-U207-沈佳熹《佳人有约？》写真集-65P-
尤果网_-U208-欣凌-写真集-65P-
尤果网_-U209-沈诺馨《百变女神》写真集-65P-
尤果网_-U210-雯雯《可妖可媚-可纯可怜》写真集-55P-
尤果网_-U211-谭睿琪《高冷女神》写真集-67P-
尤果网_-U212-模特花花-写真集-65P-
尤果网_-U213-模特果果-写真集-65P-
尤果网_-U214-王莹《透视装》写真集-64P-
尤果网_-U215-陈梓涵《纯美的稚气萝莉》写真集-63P-
尤果网_-U216-周妍希《经典珍藏级大片》写真集-65P-
尤果网_-U217-萌琪琪《穿破次元壁的女神》写真集-67P-
尤果网_-U218-爱丽莎《最完美的礼物》写真集-65P-
尤果网_-U219-模特夏夏-写真集-69P-
尤果网_-U220-模特球球-写真集-71P-
尤果网_-U221-杨晨晨-sugar小甜心CC-写真集-65P-
尤果网_-U222-Abby金金《炼狱中欲望的阎魔》写真集-59P-
尤果网_-U223-赵小米Kitty-写真集-65P-
尤果网_-U224-阿依努尔瓦娅《唯爱美人唯爱伊》写真集-65P-
尤果网_-U225-爱菲《巨兔的诱惑》写真集-66P-
尤果网_-U226-宁然-欣凌-写真集-65P-
尤果网_-U227-周予然《女神光芒》写真集-65P-
尤果网_-U228-K8傲娇萌萌《熟透了的蜜桃》写真集-63P-
尤果网_-U229-艺宁《契约爱人》写真集-65P-
尤果网_-U230-朱赢《怦然心动》写真集-65P-
尤果网_-U231-妮小妖《囚禁的小鸟》写真集-62P-
尤果网_-U232-模特Shirley-写真集-51P-
尤果网_-U233-模特白雪-写真集-64P-
尤果网_-U234-张芷昕《全能职业女友》写真集-65P-
尤果网_-U235-模特小琪-写真集-63P-
尤果网_-U236-慕羽茜《朝思暮念》写真集-65P-
尤果网_-U237-欣蕾《美臀福利》写真集-65P-
尤果网_-U238-Mikka涵涵-写真集-68P-
尤果网_-U240-尤娜娜《娇柔媚娘》-写真集-65P-
尤果网_-U241-王恬恬《童颜少女的甜语花言》写真集-59P-
尤果网_-U242-Lanvinia《魅惑女皇》写真集-65P-
尤果网_-U243-施诗-写真集-63P-
尤果网_-U244-Elsa《黑长直的福利诱惑》-写真集-60P-
尤果网_-U245-宁然、Mikka、施诗《鸡祥如意》新年主题写真大片-65P-
尤果网_-U246-青树《新春福利》写真集-65P-
尤果网_-U247-黛斯羽-写真集-65P-
尤果网_-U248-含含《邻家小妹》写真集-65P-
尤果网_-U249-李梓然-写真集-64P-
尤果网_-U250-田梓茵-写真集-65P-
尤果网_-U251-明娜-写真集-65P-
尤果网_-U252-张馥棋-写真集-66P-
尤果网_-U253-夏乔-写真集-65P-
尤果网_-U254-王林《纯情的少女》写真集-64P-
尤果网_-U255-陈梓涵-写真集-60P-
尤果网_-U256-孙晚桐-写真集-64P-
尤果网_-U257-韩恩美《甜美的小蜜酱》写真集-59P-
尤果网_-U258-穆菲菲-写真集-70P-
尤果网_-U259-白熙萌-写真集-65P-
尤果网_-U260-沐伊-写真集-65P-
尤果网_-U261-金baby-写真集-65P-
尤果网_-U262-杨晨晨-写真集-64P-
尤果网_-U263-小七-写真集-65P-
尤果网_-U265-Maggie《混血风情》写真集-65P-
尤果网_-U266-蒋贝贝-写真集-64P-
尤果网_-U267-李凌子《甜美的爱恋》写真集-65P-
尤果网_-U268-茉莉-写真集-64P-
尤果网_-U269-惠子-写真集-65P-
尤果网_-U271-若涵-写真集-65P-
尤果网_-U272-金禹熙-写真集-65P-
尤果网_-U273-倪叶藤-写真集-64P-
尤果网_-U276-夏雨桐-写真集-66P-
尤果网_-U277-于梓馨-写真集-65P-
尤果网_-U278-木木-写真集-62P-
尤果网_-U280-李颜儿-写真集-64P-
尤果网_-U281-漫兮-写真集-64P-
尤果网_-U283-杨果果-写真集-55P-
尤果网_Vicky《机器人女友》-U398-写真集-65P-
尤果网_Wendy《超萌的萝莉》-U397-写真集-62P-
尤果网_Zora若拉《最喜欢的还是你》-U350-写真集-65P-
尤果网_一只香蕉船《扣人心弦的感觉》-U426-写真集-65P-
尤果网_丁筱南《完美翘臀-amp-amp-amp-湿身诱惑》-U285-写真集-64P-
尤果网_乔依琳《春宵一梦》-U344-写真集-65P-
尤果网_于娜《甜美的暴力》写真集-U141--60P-
尤果网_于思琪《海边姑娘》-U379-写真集-65P-
尤果网_伊莉娜《如此婀娜，如此柔情》-U321-写真集-65P-
尤果网_何周周《你的心房》-U365-写真集-65P-
尤果网_何嘉颖《山野中的精灵》-U318-写真集-65P-
尤果网_何曼丽《爱不够的粉色情人》写真集-U151--65P-
尤果网_佟蔓《小女人到女王到转变正在进行时！》写真集-U114--50P-
尤果网_佟蔓《最是那一低头的温柔.恰似水莲花》写真集-U089--54P-
尤果网_佳佳《三拍白骨精》写真集-U109--65P-
尤果网_佳宝《童话里的诱惑》-U328-写真集-65P-
尤果网_信悦儿-叶赫那拉信悦《性感外衣》-写真集-U134--55P-
尤果网_倪叶藤-amp-amp-amp-艾小青《风从海边来》-T026-写真集-65P-
尤果网_冯木木、孟狐狸、朱赢《初夏蜜语》-T022-写真集-70P-
尤果网_凌希儿《女神的猎场》-U325-写真集-65P-
尤果网_凌菲-U302-写真集-65P-
尤果网_刘天天《似水柔情》-U327-写真集-65P-
尤果网_刘姗姗-U297-写真集-65P-
尤果网_可欣《爱情与神人》-U415-写真集-65P-
尤果网_叶子-U307-写真集-65P-
尤果网_叶汐《一叶倾心》-U335-写真集-65P-
尤果网_叶籽亿《波涛汹涌-狂野诱惑》写真集-U085--58P-
尤果网_叶籽亿《金发芭比》写真集-U127--66P-
尤果网_司徒林《爱情故事里的女主角》-U331-写真集-65P-
尤果网_周于希《女神带你吃鸡》-U374-写真集-65P-
尤果网_周妍希、李颜儿《何不放粽》-U275-写真集-65P-
尤果网_周心情《原始的欲望》-U360-写真集-65P-
尤果网_唐溪若《充满灵气的少女》-U299-写真集-65P-
尤果网_《四周年》-T029-写真集-79P-
尤果网_夏玲蔓-amp-amp-amp-M梦baby《子夜弥撒》-T038-写真集-65P-
尤果网_夏瑶《大眼睛的萌系少女》-U406-写真集-65P-
尤果网_女神模特Sara《春困》-U357-写真集-65P-
尤果网_奶茶Emily《我的天使》-U410-写真集-65P-
尤果网_妮可《hello！妮可》-U329-写真集-65P-
尤果网_孙嘉言-小紫藤-金鑫-李娅萦-春娇《足球宝贝》写真集-T019--66P-
尤果网_孟思雨-U296-写真集-65P-
尤果网_孟狐狸《缠绵悱恻的爱情故事》写真集-U139--64P-
尤果网_孟狐狸-麦苹果-王瑞儿《狐狸记》-写真集-T017--65P-
尤果网_宁夏《宁静的夏》-U378-写真集-65P-
尤果网_安柔《魅惑至极》-U322-写真集-65P-
尤果网_安沛蕾《狂野的原始诱惑》-U390-写真集-65P-
尤果网_安沛蕾《甜美可人儿的狂野》-写真集-U144--55P-
尤果网_小兔-U288-写真集-64P-
尤果网_小喜《藏不住的喜欢你》-U419-写真集-65P-
尤果网_小沫《迷人的小沫》-U351-写真集-65P-
尤果网_小琪-amp-amp-amp-安柔《年年尤果》-T031-写真集-65P-
尤果网_小甜心《甜心计划》-U340-写真集-65P-
尤果网_小软《温柔的柔软》写真集-U084--58P-
尤果网_尤娜娜《黑白之间的极度诱惑》-U284-写真集-62P-
尤果网_尤柔美《天生尤物，万种柔情，艳美百变》-U342-写真集-65P-
尤果网_尤菲儿《异国混血般的诱惑》-U291-写真集-65P-
尤果网_尤菲儿《暧昧的游戏》-U407-写真集-66P-
尤果网_尤菲儿《沙滩纹身女郎》-U383-写真集-65P-
尤果网_尹菲《完美的自己》-U388-写真集-65P-
尤果网_布莱尔昆娜《D杯混血-性感来袭》写真集-U080--63P-
尤果网_布莱尔昆娜《空姐日记》写真集-U099--65P-
尤果网_幂书-U304-写真集-65P-
尤果网_张之龄《诱惑的微笑》-U334-写真集-65P-
尤果网_张冬《特别挑战》写真集-U118--60P-
尤果网_张多多《舍不得和你说声晚安》-U352-写真集-65P-
尤果网_张小西《小娇羞的青涩之夏》写真集-U086--51P-
尤果网_张栩菲《夏日纪念册》写真集-U116--47P-
尤果网_张美荧《十分钟的恋爱》写真集-U112--65P-
尤果网_张鑫《爱的初体验》写真集-U147--64P-
尤果网_张馨彤《孤单的人》-U385-写真集-65P-
尤果网_彩儿-U303-写真集-65P-
尤果网_徐梓伊《女神公主》-U359-写真集-65P-
尤果网_慕羽茜《不为下一秒担忧》写真集-U098--60P-
尤果网_慕羽茜《性感至极》写真集-U120--65P-
尤果网_方子萱-U290-写真集-65P-
尤果网_方子萱《诱人的小秘密》-U393-写真集-65P-
尤果网_晨曦-周小然《36D天团女神》-写真集-U150--62P-
尤果网_景思晴《暖洋洋的晴天女神》-U343-写真集-65P-
尤果网_曼妮儿《奶油少女》-U312-写真集-65P-
尤果网_朱赢《弱水三千-只爱朱赢》写真集-U148--63P-
尤果网_李丁丁《红玫瑰与白玫瑰》-写真集-U096--49P-
尤果网_李凌子《性感的代名词》-U339-写真集-65P-
尤果网_李唯一《唯一的礼物》-U356-写真集-66P-
尤果网_李宝儿《想念不如相见》-U354-写真集-65P-
尤果网_李思宁《限量版芭比娃娃》写真集-U138--65P-
尤果网_李易童《美女情圣》-U346-写真集-65P-
尤果网_李焱《纯白的梦里花》-U361-写真集-64P-
尤果网_李莉莉《夏天想要的感觉》-U372-写真集-65P-
尤果网_杜小雨《温暖的小雨》-U333-写真集-65P-
尤果网_杜花花《心花怒放》-U417-写真集-65P-
尤果网_杜花花《骨子里的酥媚诱惑》-U373-写真集-65P-
尤果网_杨乔之-U310-写真集-65P-
尤果网_杨佩《拳击女郎》写真集-U168--65P-
尤果网_杨漫妮《让美臀陪你过暖冬》写真集-U137--65P-
尤果网_林熙《如此美臀》-U289-写真集-50P-
尤果网_栗子《单身情人节》-T030-写真集-65P-
尤果网_栗子《极度诱惑》-U416-写真集-65P-
尤果网_桃子《害羞的诱惑》-U413-写真集-65P-
尤果网_桃香子《三面喜欢》-T040-写真集-70P-
尤果网_梓安-杨漫妮-李思宁《三蜜升职记》写真集-T015--64P-
尤果网_梦心玥-果冻-陈亦菲-Merry-林熙-程瑜西《2018世界波》-T034-写真集--65P-
尤果网_梦心玥-艾小青-程瑜西-萌汉药-何嘉颖-艺轩-筱慧-球球《助力女神》-T035-写真集-80P-
尤果网_模特Aleo《妩媚的气味》-U408-写真集-65P-
尤果网_模特David《青春的心动》-U358-写真集-65P-
尤果网_模特Gaia《足球宝贝》-U380-写真集-65P-
尤果网_模特Lucy《迷人的长腿》-U363-写真集-65P-
尤果网_模特Mina《浪漫主题的现代诗歌》-U375-写真集-63P-
尤果网_模特Nicole《加浓的甜美》-U404-写真集-65P-
尤果网_模特Silin《这美好的一切》-U368-写真集-65P-
尤果网_模特小野猫《迷人的小野猫》-U381-写真集-65P-
尤果网_模特李可《狂野淑女》-U370-写真集-65P-
尤果网_模特果冻《东方的韵味》-U394-写真集-65P-
尤果网_模特米米《独一无二的米》-U405-写真集-65P-
尤果网_模特芦奇《妖而不艳，媚而不俗》-U366-写真集-65P-
尤果网_模特陈一《经典的温柔》-U371-写真集-65P-
尤果网_欣怡《恋爱的自习室》-U411-写真集-65P-
尤果网_欣杨Kitty《挑战你的视觉》写真集-U125--65P-
尤果网_毛COCO《高超的甜秘密》-U409-写真集-65P-
尤果网_汤伊浅、木兰、李焮苒《浪漫一夏》-T023-写真集-70P-
尤果网_沈佳熹-颜爱泽-于思琪《合家欢》写真集-T020--52P-
尤果网_泡芙少女《忧郁少女》-U403-写真集-65P-
尤果网_涉谷由里《丰厚的福利》-U399-写真集-65P-
尤果网_涉谷由里《美景美人》-U400-写真集-65P-
尤果网_温鈊怡《粽欲》写真集-T018--65P-
尤果网_温鈊怡《美人欲》写真集-U157--63P-
尤果网_爱丽莎-U286-写真集-65P-
尤果网_爱丽莎、爱菲、Jasmine《第二个情人节》-T022-写真集-68P-
尤果网_王凌宇《来不及说我爱你》写真集-U092--63P-
尤果网_王尔琳《淡淡的女人香》写真集-U146--64P-
尤果网_王瑞儿《仲夏夜的魅惑》写真集-U094--61P-
尤果网_王瑞儿《美杜莎的温柔》-写真集-U128--63P-
尤果网_王翊涵《美人戏水》-U392-写真集-65P-
尤果网_王谨轩《夏天轻时光》写真集-U095--44P-
尤果网_珞可可《蛇蝎女佣》写真集-U149--63P-
尤果网_球球《九头身女王》-U382-写真集-65P-
尤果网_琪歌《硬朗充满力量的运动大片》-U279-写真集-65P-
尤果网_琳丽-U427-写真集-65P-
尤果网_田慕儿《秋天的浓情蜜意》-U311-写真集-65P-
尤果网_田梓茵《沙漠中的烟火》-U376-写真集-65P-
尤果网_田熙玥《这个百变女郎》写真集-U152--63P-
尤果网_白一晗《惹火的小猫》-U412-写真集-65P-
尤果网_白晓白《轻熟的水果》-U395-写真集-65P-
尤果网_程瑜西-amp-amp-amp-孙嘉琪《尤乐时刻》-U414-写真集-65P-
尤果网_程瑜西《割舍不下的爱》-U367-写真集-65P-
尤果网_穆菲菲《冰雪女神》-U336-写真集-65P-
尤果网_穆菲菲《复古风情》-U309-写真集-63P-
尤果网_穆菲菲《颜》-U420-写真集-67P-
尤果网_筱慧-U305-写真集-65P-
尤果网_糖果《果酱系少女》-U326-写真集-65P-
尤果网_纯小希《弱気娘-性感小公举》-写真集-U117--63P-
尤果网_美替-U424-写真集-65P-
尤果网_美替《当家花旦》-U396-写真集-65P-
尤果网_艺轩《夏至大片》-U282-写真集-65P-
尤果网_艺轩《海的女儿》-U316-写真集-64P-
尤果网_艾可丝《模拟女友》-U338-写真集-65P-
尤果网_艾小青-U425-写真集-65P-
尤果网_艾小青《性感的传说》-U292-写真集-65P-
尤果网_艾琳娜-U293-写真集-65P-
尤果网_艾霓莎-U298-写真集-65P-
尤果网_芊小童《窒息般的诱惑》-U301-写真集-65P-
尤果网_芝芝Booty《芝芝》-U421-写真集-65P-
尤果网_苏可可《完美女神》-U341-写真集-65P-
尤果网_苏小曼-amp-amp-amp-方子萱《白月光》-T037-写真集-65P-
尤果网_苏糯米《立春》写真集-U153--69P-
尤果网_苏糯米《童颜巨乳-秒杀宅男》-写真集-U082--34P-
尤果网_若彤BOOMBOOM《性感的纯真》-U384-写真集-60P-
尤果网_莫妮卡《孤独的Monica》-U377-写真集-65P-
尤果网_萌汉药baby《爆乳魅惑》-U386-写真集-65P-
尤果网_萌神妹妹《萌空血槽的萝莉卷》-U274-写真集-65P-
尤果网_萌神白熙萌《喷血福利！》-U319-写真集-65P-
尤果网_萌萌《谁说美女不爱运动》-写真集-U090--55P-
尤果网_蜜儿《少女如此多娇》-U353-写真集-65P-
尤果网_蜜桃美女刘嘉琦《将诱惑进行到底》写真集-U091--65P-
尤果网_许文婷《二次元主题性感大片》写真集-U132--65P-
尤果网_贝拉《魅惑尤物》-U337-写真集-65P-
尤果网_赵伊彤《风情万种野玫瑰》写真集-U093--48P-
尤果网_赵佳琪《初恋的记忆》-U314-写真集-65P-
尤果网_赵娜娜《梦醒时分》-U332-写真集-65P-
尤果网_赵小米《春天的祝福》写真集-U160--65P-
尤果网_赵智妍-amp-amp-amp-筱慧《春花秋月何时了》-T027-写真集-65P-
尤果网_赵智妍《柔情一袭》-U300-写真集-65P-
尤果网_赵颖儿《邻家少女》-U362-写真集-65P-
尤果网_金佳佳《诱人的礼物》-U364-写真集-65P-
尤果网_金子熙《爱的礼物》写真集-U143--57P-
尤果网_金美子《美人美酒》-U323-写真集-87P-
尤果网_金露-amp-amp-amp-Angela楚楚《粽思夜》-T041-写真集-60P-
尤果网_金露《情人的火焰》-U391-写真集-65P-
尤果网_阿V-温心彤-奶油-戴米-田慕儿-艺轩-颜爱泽《七情》-T025-写真集-75P-
尤果网_陈七七《幻想少女》-U315-写真集-65P-
尤果网_陈夕《温暖的嘴唇》-U320-写真集-64P-
尤果网_陈宝拉《风情万种-勾人心魄》写真集-U083--45P-
尤果网_陈幼伊《天真有邪》-U418-写真集-65P-
尤果网_陈雅漫-《上瘾的诱惑》写真集-U131--65P-
尤果网_霓梓心《巨型胸器登场》写真集-U140--44P-
尤果网_露西《极致诱惑的大美女》-U313-写真集-65P-
尤果网_青树-阿依努尔瓦娅的友情客串-U295-写真集-65P-
尤果网_青树《青树之恋》-U401-写真集-65P-
尤果网_韩乐优《尤乐少女》-U348-写真集-65P-
尤果网_韩安琪-童安琪-《好风光》-U387-写真集-65P-
尤果网_韩恩熙《动漫系小姐姐》-U345-写真集-65P-
尤果网_韩恩熙《牛奶肌少女》-U294-写真集-65P-
尤果网_韩沫瑜《对女神的所有幻想》-U369-写真集-65P-
尤果网_顾欣怡《色易守-情难防》写真集-U106--50P-
尤果网_颜亦汐《立体的诱惑》-U349-写真集-65P-
尤果网_颜忆霖-U306-写真集-65P-
尤果网_颜爱泽-萌琪琪-莉恩《happy-new-year》写真集-U239--65P-
尤果网_骆雪淇《美人记号》-U389-写真集-65P-
尤果网_黛蓓琪《萝莉诚可贵-御姐价更高》写真集-U088--55P-
尤果网_齐贝贝《电眼教主》写真集-U103--39P-
尤果网_龙儿《异国诱惑》-U347-写真集-65P-
EOF;


$folder_full_path = isset($argv[1]) ? $argv[1] : null;

if(empty($folder_full_path)) {
    echo "---- Must have a full folder path as the param! \n";
    exit;
}

$dryrun = 0;
$org_name = '尤果网';
$org_name_en = 'UGirls';

$scan = scandir($folder_full_path);
foreach($scan as $folder_name) {
   if (is_dir("$folder_full_path/$folder_name") && $folder_name!='.' && $folder_name!='..' ) {
        $the_full_path = "$folder_full_path/$folder_name";
        echo "------------------------- \n";
        echo "-- Current folder: $folder_name \n";
        // Get cuurent folder vol number
        $l_folder_name = strtolower($folder_name);
        //$l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
        $l = $folder_name;
        $first = 'No.';
        if(strstr($l, ' U') !== false) {$first = ' U';}
        if(strstr($l, ' E') !== false && strstr($l, ' Elsa') === false) {$first = ' E';}
        if(strstr($l, ' T') !== false) {$first = ' T';}
        if(strstr($l, ' F') !== false) {$first = ' F';}
        $v_arr = find_between($l, $first, ' ');
        // $v_arr = explode(' ',$l_folder_name);
        // $v_arr = find_between($l_folder_name, 'no.', ' ');
        $vol = trim($first.$v_arr[0]);

        // $vol = str_replace('no.', '', $vol);
        // Go to origin path to get folder name with the same vol num
        $origin = getOriginFolderByVol($vol);
        echo print_r($origin,1) . "\n"; 
        
        if(!empty($origin)) {
            // copy desc.txt and tags.txt from origin folder
            $desc_str = file_get_contents($origin['full_path'] . "/desc.txt");
            $desc_str = str_replace(' 生日','生日', $desc_str);
            $pos = strpos($desc_str, '生日');
            if($pos !== false) {
                $c = $desc_str[$pos-1];
                if ($c != "\n" && $c != "\rn" && $c != "\r") {
                    $desc_str = str_replace('生日',"\n生日", $desc_str);
                }
            }
            $desc_str = str_replace(' 罩杯','罩杯', $desc_str);
            $pos = strpos($desc_str, '罩杯');
            if($pos !== false) {
                $c = $desc_str[$pos-1];
                if ($c != "\n" && $c != "\rn" && $c != "\r") {
                    $desc_str = str_replace('罩杯',"\n罩杯", $desc_str);
                }
            }
            echo "Processing " . $the_full_path . "/desc.txt \n";
            if(!$dryrun) file_put_contents($the_full_path.'/desc.txt', $desc_str);
            
            // copy($origin['full_path'] . "/tags.txt", $the_full_path . "/tags.txt");

            // Gen new tags
            $tags_str = file_get_contents($origin['full_path'] . "/tags.txt");
            $tags = explode(',', $tags_str);
            if(! in_array($org_name_en, $tags) && ! in_array(strtolower($org_name_en), $tags)) {
                $tags[] = $org_name_en;
            }
            if(! in_array( $org_name, $tags ) ) {
                $tags[] = $org_name;
            }
            if(! in_array( $origin['model'], $tags ) ) {
                $tags[] = $origin['model'];
            }
            $new_tags_str = implode(',', $tags);
            $new_tags_str = str_replace(strtolower($org_name_en), $org_name_en, $new_tags_str);
            echo "---- New tags: $new_tags_str \n";
            // create tags.txt
            echo "file_put_contents($the_full_path/tags.txt, $new_tags_str) \n";
            if(!$dryrun) file_put_contents($the_full_path.'/tags.txt', $new_tags_str);

            // create a new empty dl.txt in current folder
            echo "file_put_contents($the_full_path/dl.txt, '') \n";
            if(!$dryrun) file_put_contents($the_full_path.'/dl.txt', '');

            // Handle thumbnail.jpg
            $scan2 = scandir($the_full_path);
            $images = [];
            $already_has_thumbnail = false;
            foreach($scan2 as $file) {
                $origin_file_full = $the_full_path . '/' . $file;
                if($file == 'cover.jpg') {
                    rename($the_full_path . '/cover.jpg' , $the_full_path . '/thumbnail.jpg');
                    $file = 'thumbnail.jpg';
                }
                if($file == 'thumbnail.jpg') $already_has_thumbnail = true;
                // if ( is_file($origin_file_full) && @is_array(getimagesize($origin_file_full)) ) {
                //     $images[] = $file;
                // }
            }
            // natsort($images);
            
            // if($already_has_thumbnail) {
            //     echo "---- Already has a thumbnail.jpg \n\n";
            // }
            // else {
            //     // if((int)$vol < 37) {
            //     //   $thumb = $images[0];
            //     // }
            //     // else {
            //         $thumb = $images[count($images) - 1];
            //     // }
            //     echo 'rename('. $the_full_path . '/' . $thumb . ', ' . $the_full_path . '/thumbnail.jpg' .  "\n\n";
            //     if(!$dryrun) rename($the_full_path . '/' . $thumb , $the_full_path . '/thumbnail.jpg');    
            // }

            // rename current folder to the origin folder name
            if(!empty($origin['main'] )) {
                // $x = explode(' ', $folder_name);
                $x = find_between($folder_name, ']', ' ');
                $last = $x[0];

                // $vol = str_replace('no.', '', $vol);
                
                $new_folder_name = $org_name_en.$org_name.'-'. ucfirst($vol) . '-'.$origin['model'] . '-' . $origin['main'] . '-'.$last;
                // $new_folder_name = $org_name_en.$org_name.'-'. strtoupper($vol) . '-' . $origin['main'];
                echo "rename $the_full_path to $folder_full_path/$new_folder_name\n\n";
                if(!$dryrun) rename($the_full_path, $folder_full_path . '/'.$new_folder_name);

                // $desc = str_replace('-', ' ', $new_folder_name);
                // $desc .= '。欢迎下载高清无水印套图。';
                // echo "Processing " . $the_full_path . "/desc.txt \n";
                // if(!$dryrun) file_put_contents($folder_full_path . '/'.$new_folder_name.'/desc.txt', $desc);
            }
            
            
        }
        else {
            echo "-- Cannot find mapped folder ...\n";
        }
   }
}



function getOriginFolderByVol($vol_num) {
    global $dirs;
    
    global $org_name;
    
    $vol_num = strtolower($vol_num);
    // $vol_num = str_replace('u', 'e', $vol_num);
    // echo "vol_num = $vol_num \n"; 
    // exit;
    
    $origin_folders = '/mnt/nas/jw-photos/tujigu/' . $org_name;
    // $scan = scandir($origin_folders);
    $scan = explode("\r\n", $dirs);

    $folder_info = [];
    
    foreach($scan as $folder_name) {      
        // echo "folder: $folder_name \n";  
        if (is_dir("$origin_folders/$folder_name") && $folder_name!='.' && $folder_name!='..') {

            $l_folder_name = strtolower($folder_name);
            $l_folder_name = str_replace('vol.', 'no.', $l_folder_name);
            //echo "l_folder: $l_folder_name \n"; 
            // exit;
            if(strpos($l_folder_name, $vol_num) !== false) {
                $folder_info['full_path'] = $origin_folders  . '/' . $folder_name;

                $l_folder_name = sanatizeCN($l_folder_name);
                $l_folder_name = str_replace('_-','_',$l_folder_name);
                $l_folder_name = str_replace('《','-',$l_folder_name);
                $l_folder_name = str_replace('》','-',$l_folder_name);
                $l_folder_name = str_replace('---','-',$l_folder_name);
                $l_folder_name = str_replace('--','-',$l_folder_name);
                $folder_info['name'] = $l_folder_name;

                $l_folder_name = mapModelNames($l_folder_name);
                $l_folder_name = str_replace($org_name.'-',$org_name.'_', $l_folder_name);
                
                $tt = find_between($l_folder_name, $org_name.'_', '-');
                if(str_starts_with($tt[0], 'u')) {
                    $ss = find_between($l_folder_name, '-', '-');
                    $folder_info['model'] = my_mb_ucfirst(sanatizeCN($ss[0]));
                }
                else {
                    $xx = find_between($l_folder_name, $org_name.'_', '-');
                    $folder_info['model'] = my_mb_ucfirst(sanatizeCN($xx[0]));
                    //$yy = find_between($l_folder_name, $org_name.'_', '-no');
                    
                }
                $folder_info['model'] = str_replace('YUmi尤美', 'Yumi尤美', $folder_info['model']);


                if(strpos($folder_name, '《') !== false) {
                    $yy = find_between($folder_name, '《', '》');
                    $main = empty($yy[0]) ? '' : trim($yy[0], '-');
                }
                else {
                    $yy = find_between($folder_name, '---', '-');
                    $main = empty($yy[0]) ? '' : trim($yy[0], '-');
                }
                if(empty($main)) {
                    $xx = explode('-', $folder_name);
                    $main = $xx[2];
                }
                $main = empty($main) ? '' : '《' .my_mb_ucfirst(sanatizeCN($main))  . '》';
                $folder_info['main'] = $main;
                break;
            }
        }
    }

    return $folder_info;
}
